/* automatically generated by rust-bindgen 0.69.5 */

pub const VPX_IMAGE_ABI_VERSION: u32 = 5;
pub const VPX_IMG_FMT_PLANAR: u32 = 256;
pub const VPX_IMG_FMT_UV_FLIP: u32 = 512;
pub const VPX_IMG_FMT_HAS_ALPHA: u32 = 1024;
pub const VPX_IMG_FMT_HIGHBITDEPTH: u32 = 2048;
pub const VPX_PLANE_PACKED: u32 = 0;
pub const VPX_PLANE_Y: u32 = 0;
pub const VPX_PLANE_U: u32 = 1;
pub const VPX_PLANE_V: u32 = 2;
pub const VPX_PLANE_ALPHA: u32 = 3;
pub const VPX_CODEC_ABI_VERSION: u32 = 9;
pub const VPX_CODEC_CAP_DECODER: u32 = 1;
pub const VPX_CODEC_CAP_ENCODER: u32 = 2;
pub const VPX_CODEC_CAP_HIGHBITDEPTH: u32 = 4;
pub const VPX_TPL_ABI_VERSION: u32 = 5;
pub const VPX_EXT_RATECTRL_ABI_VERSION: u32 = 12;
pub const VPX_RC_MAX_STATIC_GF_GROUP_LENGTH: u32 = 250;
pub const VPX_RC_MAX_REF_FRAMES: u32 = 4;
pub const VPX_DEFAULT_Q: i32 = -1;
pub const VPX_DEFAULT_RDMULT: i32 = -1;
pub const VPX_TS_MAX_PERIODICITY: u32 = 16;
pub const VPX_TS_MAX_LAYERS: u32 = 5;
pub const VPX_MAX_LAYERS: u32 = 12;
pub const VPX_SS_MAX_LAYERS: u32 = 5;
pub const VPX_SS_DEFAULT_LAYERS: u32 = 1;
pub const VPX_ENCODER_ABI_VERSION: u32 = 39;
pub const VPX_CODEC_CAP_PSNR: u32 = 65536;
pub const VPX_CODEC_CAP_OUTPUT_PARTITION: u32 = 131072;
pub const VPX_CODEC_USE_PSNR: u32 = 65536;
pub const VPX_CODEC_USE_OUTPUT_PARTITION: u32 = 131072;
pub const VPX_CODEC_USE_HIGHBITDEPTH: u32 = 262144;
pub const VPX_FRAME_IS_KEY: u32 = 1;
pub const VPX_FRAME_IS_DROPPABLE: u32 = 2;
pub const VPX_FRAME_IS_INVISIBLE: u32 = 4;

pub const vpx_color_space_VPX_CS_RESERVED: vpx_color_space = 6;
#[doc = "< sRGB"]
pub const vpx_color_space_VPX_CS_SRGB: vpx_color_space = 7;
#[doc = "\\brief List of supported color spaces"]
pub type vpx_color_space = ::std::os::raw::c_int;
#[doc = "\\brief List of supported color spaces"]
pub use self::vpx_color_space as vpx_color_space_t;
#[doc = "<- Y  [16..235],  UV  [16..240]  (bit depth 8) */\n/**<- Y  [64..940],  UV  [64..960]  (bit depth 10) */\n/**<- Y [256..3760], UV [256..3840] (bit depth 12)"]
pub const vpx_color_range_VPX_CR_STUDIO_RANGE: vpx_color_range = 0;
#[doc = "<- YUV/RGB [0..255]  (bit depth 8) */\n/**<- YUV/RGB [0..1023] (bit depth 10) */\n/**<- YUV/RGB [0..4095] (bit depth 12)"]
pub const vpx_color_range_VPX_CR_FULL_RANGE: vpx_color_range = 1;
#[doc = "\\brief List of supported color range"]
pub type vpx_color_range = ::std::os::raw::c_int;
#[doc = "\\brief List of supported color range"]
pub use self::vpx_color_range as vpx_color_range_t;
#[doc = "\\brief Image Descriptor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_image {
    #[doc = "< Image Format"]
    pub fmt: vpx_img_fmt_t,
    #[doc = "< Color Space"]
    pub cs: vpx_color_space_t,
    #[doc = "< Color Range"]
    pub range: vpx_color_range_t,
    #[doc = "< Stored image width"]
    pub w: ::std::os::raw::c_uint,
    #[doc = "< Stored image height"]
    pub h: ::std::os::raw::c_uint,
    #[doc = "< Stored image bit-depth"]
    pub bit_depth: ::std::os::raw::c_uint,
    #[doc = "< Displayed image width"]
    pub d_w: ::std::os::raw::c_uint,
    #[doc = "< Displayed image height"]
    pub d_h: ::std::os::raw::c_uint,
    #[doc = "< Intended rendering image width"]
    pub r_w: ::std::os::raw::c_uint,
    #[doc = "< Intended rendering image height"]
    pub r_h: ::std::os::raw::c_uint,
    #[doc = "< subsampling order, X"]
    pub x_chroma_shift: ::std::os::raw::c_uint,
    #[doc = "< subsampling order, Y"]
    pub y_chroma_shift: ::std::os::raw::c_uint,
    #[doc = "< pointer to the top left pixel for each plane"]
    pub planes: [*mut ::std::os::raw::c_uchar; 4usize],
    #[doc = "< stride between rows for each plane"]
    pub stride: [::std::os::raw::c_int; 4usize],
    #[doc = "< bits per sample (for packed formats)"]
    pub bps: ::std::os::raw::c_int,
    #[doc = "\\brief The following member may be set by the application to associate\n data with this image."]
    pub user_priv: *mut ::std::os::raw::c_void,
    #[doc = "< private"]
    pub img_data: *mut ::std::os::raw::c_uchar,
    #[doc = "< private"]
    pub img_data_owner: ::std::os::raw::c_int,
    #[doc = "< private"]
    pub self_allocd: ::std::os::raw::c_int,
    #[doc = "< Frame buffer data associated with the image."]
    pub fb_priv: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_vpx_image() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_image> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_image>(),
        136usize,
        concat!("Size of: ", stringify!(vpx_image))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_image>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_image))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fmt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(fmt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cs) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(cs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).range) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(range)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bit_depth) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(bit_depth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_w) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(d_w)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_h) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(d_h)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r_w) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(r_w)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r_h) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(r_h)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x_chroma_shift) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(x_chroma_shift)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y_chroma_shift) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(y_chroma_shift)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).planes) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(planes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stride) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bps) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(bps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user_priv) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(user_priv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).img_data) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(img_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).img_data_owner) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(img_data_owner)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).self_allocd) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(self_allocd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fb_priv) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image),
            "::",
            stringify!(fb_priv)
        )
    );
}
#[doc = "\\brief Image Descriptor"]
pub type vpx_image_t = vpx_image;
#[doc = "\\brief Representation of a rectangle on a surface"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_image_rect {
    #[doc = "< leftmost column"]
    pub x: ::std::os::raw::c_uint,
    #[doc = "< topmost row"]
    pub y: ::std::os::raw::c_uint,
    #[doc = "< width"]
    pub w: ::std::os::raw::c_uint,
    #[doc = "< height"]
    pub h: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_vpx_image_rect() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_image_rect> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_image_rect>(),
        16usize,
        concat!("Size of: ", stringify!(vpx_image_rect))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_image_rect>(),
        4usize,
        concat!("Alignment of ", stringify!(vpx_image_rect))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image_rect),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image_rect),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image_rect),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_image_rect),
            "::",
            stringify!(h)
        )
    );
}
#[doc = "\\brief Representation of a rectangle on a surface"]
pub type vpx_image_rect_t = vpx_image_rect;
extern "C" {
    #[doc = "\\brief Open a descriptor, allocating storage for the underlying image\n\n Returns a descriptor for storing an image of the given format. The\n storage for the image is allocated on the heap.\n\n \\param[in]    img       Pointer to storage for descriptor. If this parameter\n                         is NULL, the storage for the descriptor will be\n                         allocated on the heap.\n \\param[in]    fmt       Format for the image\n \\param[in]    d_w       Width of the image. Must not exceed 0x08000000\n                         (2^27).\n \\param[in]    d_h       Height of the image. Must not exceed 0x08000000\n                         (2^27).\n \\param[in]    align     Alignment, in bytes, of the image buffer and\n                         each row in the image (stride). Must not exceed\n                         65536.\n\n \\return Returns a pointer to the initialized image descriptor. If the img\n         parameter is non-null, the value of the img parameter will be\n         returned."]
    pub fn vpx_img_alloc(
        img: *mut vpx_image_t,
        fmt: vpx_img_fmt_t,
        d_w: ::std::os::raw::c_uint,
        d_h: ::std::os::raw::c_uint,
        align: ::std::os::raw::c_uint,
    ) -> *mut vpx_image_t;
}
extern "C" {
    #[doc = "\\brief Open a descriptor, using existing storage for the underlying image\n\n Returns a descriptor for storing an image of the given format. The\n storage for the image has been allocated elsewhere, and a descriptor is\n desired to \"wrap\" that storage.\n\n \\param[in]    img           Pointer to storage for descriptor. If this\n                             parameter is NULL, the storage for the descriptor\n                             will be allocated on the heap.\n \\param[in]    fmt           Format for the image\n \\param[in]    d_w           Width of the image. Must not exceed 0x08000000\n                             (2^27).\n \\param[in]    d_h           Height of the image. Must not exceed 0x08000000\n                             (2^27).\n \\param[in]    stride_align  Alignment, in bytes, of each row in the image\n                             (stride). Must not exceed 65536.\n \\param[in]    img_data      Storage to use for the image. The storage must\n                             outlive the returned image descriptor; it can be\n                             disposed of after calling vpx_img_free().\n\n \\return Returns a pointer to the initialized image descriptor. If the img\n         parameter is non-null, the value of the img parameter will be\n         returned.\n\n \\note \\a img_data is required to have a minimum allocation size that\n       satisfies the requirements of the \\a fmt, \\a d_w, \\a d_h and \\a\n       stride_align parameters. This size can be calculated as follows (see\n       \\c img_alloc_helper in the vpx_image.c file in the libvpx source tree\n       for more detail):\n \\code\n align = (1 << x_chroma_shift) - 1;\n w = (d_w + align) & ~align;\n align = (1 << y_chroma_shift) - 1;\n h = (d_h + align) & ~align;\n\n s = (fmt & VPX_IMG_FMT_PLANAR) ? w : (uint64_t)bps * w / 8;\n s = (fmt & VPX_IMG_FMT_HIGHBITDEPTH) ? s * 2 : s;\n s = (s + stride_align - 1) & ~((uint64_t)stride_align - 1);\n s = (fmt & VPX_IMG_FMT_HIGHBITDEPTH) ? s / 2 : s;\n alloc_size = (fmt & VPX_IMG_FMT_PLANAR) ? (uint64_t)h * s * bps / 8\n                                         : (uint64_t)h * s;\n \\endcode\n \\a x_chroma_shift, \\a y_chroma_shift and \\a bps can be obtained by calling\n \\ref vpx_img_wrap with a non-\\c NULL \\a img_data parameter. The \\c\n vpx_image_t pointer should \\em not be used in other API calls until \\em after\n a successful call to \\ref vpx_img_wrap with a valid image buffer. For\n example:\n \\code\n vpx_img_wrap(img, fmt, d_w, d_h, stride_align, (unsigned char *)1);\n ... calculate buffer size and allocate buffer as described earlier\n vpx_img_wrap(img, fmt, d_w, d_h, stride_align, img_data);\n \\endcode"]
    pub fn vpx_img_wrap(
        img: *mut vpx_image_t,
        fmt: vpx_img_fmt_t,
        d_w: ::std::os::raw::c_uint,
        d_h: ::std::os::raw::c_uint,
        stride_align: ::std::os::raw::c_uint,
        img_data: *mut ::std::os::raw::c_uchar,
    ) -> *mut vpx_image_t;
}
extern "C" {
    #[doc = "\\brief Set the rectangle identifying the displayed portion of the image\n\n Updates the displayed rectangle (aka viewport) on the image surface to\n match the specified coordinates and size. Specifically, sets img->d_w,\n img->d_h, and elements of the img->planes[] array.\n\n \\param[in]    img       Image descriptor\n \\param[in]    x         leftmost column\n \\param[in]    y         topmost row\n \\param[in]    w         width\n \\param[in]    h         height\n\n \\return 0 if the requested rectangle is valid, nonzero (-1) otherwise."]
    pub fn vpx_img_set_rect(
        img: *mut vpx_image_t,
        x: ::std::os::raw::c_uint,
        y: ::std::os::raw::c_uint,
        w: ::std::os::raw::c_uint,
        h: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\\brief Flip the image vertically (top for bottom)\n\n Adjusts the image descriptor's pointers and strides to make the image\n be referenced upside-down.\n\n \\param[in]    img       Image descriptor"]
    pub fn vpx_img_flip(img: *mut vpx_image_t);
}
extern "C" {
    #[doc = "\\brief Close an image descriptor\n\n Frees all allocated storage associated with an image descriptor.\n\n \\param[in]    img       Image descriptor"]
    pub fn vpx_img_free(img: *mut vpx_image_t);
}
#[doc = "\\brief Operation completed without error"]
pub const vpx_codec_err_t_VPX_CODEC_OK: vpx_codec_err_t = 0;
#[doc = "\\brief Unspecified error"]
pub const vpx_codec_err_t_VPX_CODEC_ERROR: vpx_codec_err_t = 1;
#[doc = "\\brief Memory operation failed"]
pub const vpx_codec_err_t_VPX_CODEC_MEM_ERROR: vpx_codec_err_t = 2;
#[doc = "\\brief ABI version mismatch"]
pub const vpx_codec_err_t_VPX_CODEC_ABI_MISMATCH: vpx_codec_err_t = 3;
#[doc = "\\brief Algorithm does not have required capability"]
pub const vpx_codec_err_t_VPX_CODEC_INCAPABLE: vpx_codec_err_t = 4;
#[doc = "\\brief The given bitstream is not supported.\n\n The bitstream was unable to be parsed at the highest level. The decoder\n is unable to proceed. This error \\ref SHOULD be treated as fatal to the\n stream."]
pub const vpx_codec_err_t_VPX_CODEC_UNSUP_BITSTREAM: vpx_codec_err_t = 5;
#[doc = "\\brief Encoded bitstream uses an unsupported feature\n\n The decoder does not implement a feature required by the encoder. This\n return code should only be used for features that prevent future\n pictures from being properly decoded. This error \\ref MAY be treated as\n fatal to the stream or \\ref MAY be treated as fatal to the current GOP."]
pub const vpx_codec_err_t_VPX_CODEC_UNSUP_FEATURE: vpx_codec_err_t = 6;
#[doc = "\\brief The coded data for this stream is corrupt or incomplete\n\n There was a problem decoding the current frame.  This return code\n should only be used for failures that prevent future pictures from\n being properly decoded. This error \\ref MAY be treated as fatal to the\n stream or \\ref MAY be treated as fatal to the current GOP. If decoding\n is continued for the current GOP, artifacts may be present."]
pub const vpx_codec_err_t_VPX_CODEC_CORRUPT_FRAME: vpx_codec_err_t = 7;
#[doc = "\\brief An application-supplied parameter is not valid.\n"]
pub const vpx_codec_err_t_VPX_CODEC_INVALID_PARAM: vpx_codec_err_t = 8;
#[doc = "\\brief An iterator reached the end of list.\n"]
pub const vpx_codec_err_t_VPX_CODEC_LIST_END: vpx_codec_err_t = 9;
#[doc = "\\brief Algorithm return codes"]
pub type vpx_codec_err_t = ::std::os::raw::c_int;
#[doc = " \\brief Codec capabilities bitfield\n\n  Each codec advertises the capabilities it supports as part of its\n  ::vpx_codec_iface_t interface structure. Capabilities are extra interfaces\n  or functionality, and are not required to be supported.\n\n  The available flags are specified by VPX_CODEC_CAP_* defines."]
pub type vpx_codec_caps_t = ::std::os::raw::c_long;
#[doc = " \\brief Initialization-time Feature Enabling\n\n  Certain codec features must be known at initialization time, to allow for\n  proper memory allocation.\n\n  The available flags are specified by VPX_CODEC_USE_* defines."]
pub type vpx_codec_flags_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_codec_iface {
    _unused: [u8; 0],
}
#[doc = "\\brief Codec interface structure.\n\n Contains function pointers and other data private to the codec\n implementation. This structure is opaque to the application."]
pub type vpx_codec_iface_t = vpx_codec_iface;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_codec_priv {
    _unused: [u8; 0],
}
#[doc = "\\brief Codec private data structure.\n\n Contains data private to the codec implementation. This structure is opaque\n to the application."]
pub type vpx_codec_priv_t = vpx_codec_priv;
#[doc = "\\brief Iterator\n\n Opaque storage used for iterating over lists."]
pub type vpx_codec_iter_t = *const ::std::os::raw::c_void;
#[doc = "\\brief Codec context structure\n\n All codecs \\ref MUST support this context structure fully. In general,\n this data should be considered private to the codec algorithm, and\n not be manipulated or examined by the calling application. Applications\n may reference the 'name' member to get a printable description of the\n algorithm."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct vpx_codec_ctx {
    #[doc = "< Printable interface name"]
    pub name: *const ::std::os::raw::c_char,
    #[doc = "< Interface pointers"]
    pub iface: *const vpx_codec_iface,
    #[doc = "< Last returned error"]
    pub err: vpx_codec_err_t,
    #[doc = "< Detailed info, if available"]
    pub err_detail: *const ::std::os::raw::c_char,
    #[doc = "< Flags passed at init time"]
    pub init_flags: vpx_codec_flags_t,
    #[doc = "< Configuration pointer aliasing union"]
    pub config: vpx_codec_ctx__bindgen_ty_1,
    #[doc = "< Algorithm private storage"]
    pub priv_: *mut vpx_codec_priv_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vpx_codec_ctx__bindgen_ty_1 {
    pub dec: *const vpx_codec_dec_cfg,
    pub enc: *const vpx_codec_enc_cfg,
    pub raw: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_vpx_codec_ctx__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_codec_ctx__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_codec_ctx__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(vpx_codec_ctx__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_codec_ctx__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_codec_ctx__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_ctx__bindgen_ty_1),
            "::",
            stringify!(dec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_ctx__bindgen_ty_1),
            "::",
            stringify!(enc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).raw) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_ctx__bindgen_ty_1),
            "::",
            stringify!(raw)
        )
    );
}
#[test]
fn bindgen_test_layout_vpx_codec_ctx() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_codec_ctx> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_codec_ctx>(),
        56usize,
        concat!("Size of: ", stringify!(vpx_codec_ctx))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_codec_ctx>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_codec_ctx))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_ctx),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iface) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_ctx),
            "::",
            stringify!(iface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).err) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_ctx),
            "::",
            stringify!(err)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).err_detail) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_ctx),
            "::",
            stringify!(err_detail)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).init_flags) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_ctx),
            "::",
            stringify!(init_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).config) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_ctx),
            "::",
            stringify!(config)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priv_) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_ctx),
            "::",
            stringify!(priv_)
        )
    );
}
#[doc = "\\brief Codec context structure\n\n All codecs \\ref MUST support this context structure fully. In general,\n this data should be considered private to the codec algorithm, and\n not be manipulated or examined by the calling application. Applications\n may reference the 'name' member to get a printable description of the\n algorithm."]
pub type vpx_codec_ctx_t = vpx_codec_ctx;
#[doc = "<  8 bits"]
pub const vpx_bit_depth_VPX_BITS_8: vpx_bit_depth = 8;
#[doc = "< 10 bits"]
pub const vpx_bit_depth_VPX_BITS_10: vpx_bit_depth = 10;
#[doc = "< 12 bits"]
pub const vpx_bit_depth_VPX_BITS_12: vpx_bit_depth = 12;
#[doc = "\\brief Bit depth for codec\n *\n This enumeration determines the bit depth of the codec."]
pub type vpx_bit_depth = ::std::os::raw::c_int;
#[doc = "\\brief Bit depth for codec\n *\n This enumeration determines the bit depth of the codec."]
pub use self::vpx_bit_depth as vpx_bit_depth_t;
extern "C" {
    #[doc = "\\brief Return the version information (as an integer)\n\n Returns a packed encoding of the library version number. This will only\n include\n the major.minor.patch component of the version number. Note that this encoded\n value should be accessed through the macros provided, as the encoding may\n change\n in the future.\n"]
    pub fn vpx_codec_version() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\\brief Return the version information (as a string)\n\n Returns a printable string containing the full library version number. This\n may\n contain additional text following the three digit version number, as to\n indicate\n release candidates, prerelease versions, etc.\n"]
    pub fn vpx_codec_version_str() -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "\\brief Return the version information (as a string)\n\n Returns a printable \"extra string\". This is the component of the string\n returned\n by vpx_codec_version_str() following the three digit version number.\n"]
    pub fn vpx_codec_version_extra_str() -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "\\brief Return the build configuration\n\n Returns a printable string containing an encoded version of the build\n configuration. This may be useful to vpx support.\n"]
    pub fn vpx_codec_build_config() -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "\\brief Return the name for a given interface\n\n Returns a human readable string for name of the given codec interface.\n\n \\param[in]    iface     Interface pointer\n"]
    pub fn vpx_codec_iface_name(iface: *const vpx_codec_iface) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "\\brief Convert error number to printable string\n\n Returns a human readable string for the last error returned by the\n algorithm. The returned error will be one line and will not contain\n any newline characters.\n\n\n \\param[in]    err     Error number.\n"]
    pub fn vpx_codec_err_to_string(err: vpx_codec_err_t) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "\\brief Retrieve error synopsis for codec context\n\n Returns a human readable string for the last error returned by the\n algorithm. The returned error will be one line and will not contain\n any newline characters.\n\n\n \\param[in]    ctx     Pointer to this instance's context.\n"]
    pub fn vpx_codec_error(ctx: *const vpx_codec_ctx_t) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "\\brief Retrieve detailed error information for codec context\n\n Returns a human readable string providing detailed information about\n the last error. The returned string is only valid until the next\n vpx_codec_* function call (except vpx_codec_error and\n vpx_codec_error_detail) on the codec context.\n\n \\param[in]    ctx     Pointer to this instance's context.\n\n \\retval NULL\n     No detailed information is available."]
    pub fn vpx_codec_error_detail(ctx: *const vpx_codec_ctx_t) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "\\brief Destroy a codec instance\n\n Destroys a codec context, freeing any associated memory buffers.\n\n \\param[in] ctx   Pointer to this instance's context\n\n \\retval #VPX_CODEC_OK\n     The codec instance has been destroyed.\n \\retval #VPX_CODEC_INVALID_PARAM\n     ctx is a null pointer.\n \\retval #VPX_CODEC_ERROR\n     Codec context not initialized."]
    pub fn vpx_codec_destroy(ctx: *mut vpx_codec_ctx_t) -> vpx_codec_err_t;
}
extern "C" {
    #[doc = "\\brief Get the capabilities of an algorithm.\n\n Retrieves the capabilities bitfield from the algorithm's interface.\n\n \\param[in] iface   Pointer to the algorithm interface\n"]
    pub fn vpx_codec_get_caps(iface: *const vpx_codec_iface) -> vpx_codec_caps_t;
}
extern "C" {
    #[doc = "\\brief Control algorithm\n\n This function is used to exchange algorithm specific data with the codec\n instance. This can be used to implement features specific to a particular\n algorithm.\n\n This wrapper function dispatches the request to the helper function\n associated with the given ctrl_id. It tries to call this function\n transparently, but will return #VPX_CODEC_ERROR if the request could not\n be dispatched.\n\n Note that this function should not be used directly. Call the\n #vpx_codec_control wrapper macro instead.\n\n \\param[in]     ctx              Pointer to this instance's context\n \\param[in]     ctrl_id          Algorithm specific control identifier\n\n \\retval #VPX_CODEC_OK\n     The control request was processed.\n \\retval #VPX_CODEC_ERROR\n     The control request was not processed.\n \\retval #VPX_CODEC_INVALID_PARAM\n     The data was not valid."]
    pub fn vpx_codec_control_(
        ctx: *mut vpx_codec_ctx_t,
        ctrl_id: ::std::os::raw::c_int,
        ...
    ) -> vpx_codec_err_t;
}
#[doc = "\\brief Temporal dependency model stats for each block before propagation"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VpxTplBlockStats {
    #[doc = "< Pixel row of the top left corner"]
    pub row: i16,
    #[doc = "< Pixel col of the top left corner"]
    pub col: i16,
    #[doc = "< Intra cost"]
    pub intra_cost: i64,
    #[doc = "< Inter cost"]
    pub inter_cost: i64,
    #[doc = "< Motion vector row in pixel"]
    pub mv_r: i16,
    #[doc = "< Motion vector col in pixel"]
    pub mv_c: i16,
    #[doc = "< Rate from source ref frame"]
    pub srcrf_rate: i64,
    #[doc = "< Distortion from source ref frame"]
    pub srcrf_dist: i64,
    #[doc = "< Prediction error"]
    pub pred_error: i64,
    #[doc = "< Inter prediction error"]
    pub inter_pred_err: i64,
    #[doc = "< Intra prediction error"]
    pub intra_pred_err: i64,
    #[doc = "< Ref frame index in the ref frame buffer"]
    pub ref_frame_index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_VpxTplBlockStats() {
    const UNINIT: ::std::mem::MaybeUninit<VpxTplBlockStats> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VpxTplBlockStats>(),
        80usize,
        concat!("Size of: ", stringify!(VpxTplBlockStats))
    );
    assert_eq!(
        ::std::mem::align_of::<VpxTplBlockStats>(),
        8usize,
        concat!("Alignment of ", stringify!(VpxTplBlockStats))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).row) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplBlockStats),
            "::",
            stringify!(row)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).col) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplBlockStats),
            "::",
            stringify!(col)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).intra_cost) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplBlockStats),
            "::",
            stringify!(intra_cost)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inter_cost) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplBlockStats),
            "::",
            stringify!(inter_cost)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mv_r) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplBlockStats),
            "::",
            stringify!(mv_r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mv_c) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplBlockStats),
            "::",
            stringify!(mv_c)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srcrf_rate) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplBlockStats),
            "::",
            stringify!(srcrf_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srcrf_dist) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplBlockStats),
            "::",
            stringify!(srcrf_dist)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pred_error) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplBlockStats),
            "::",
            stringify!(pred_error)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inter_pred_err) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplBlockStats),
            "::",
            stringify!(inter_pred_err)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).intra_pred_err) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplBlockStats),
            "::",
            stringify!(intra_pred_err)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ref_frame_index) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplBlockStats),
            "::",
            stringify!(ref_frame_index)
        )
    );
}
#[doc = "\\brief Temporal dependency model stats for each frame before propagation"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VpxTplFrameStats {
    #[doc = "< Frame width"]
    pub frame_width: ::std::os::raw::c_int,
    #[doc = "< Frame height"]
    pub frame_height: ::std::os::raw::c_int,
    #[doc = "< Number of blocks. Size of block_stats_list"]
    pub num_blocks: ::std::os::raw::c_int,
    #[doc = "< List of tpl stats for each block"]
    pub block_stats_list: *mut VpxTplBlockStats,
}
#[test]
fn bindgen_test_layout_VpxTplFrameStats() {
    const UNINIT: ::std::mem::MaybeUninit<VpxTplFrameStats> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VpxTplFrameStats>(),
        24usize,
        concat!("Size of: ", stringify!(VpxTplFrameStats))
    );
    assert_eq!(
        ::std::mem::align_of::<VpxTplFrameStats>(),
        8usize,
        concat!("Alignment of ", stringify!(VpxTplFrameStats))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_width) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplFrameStats),
            "::",
            stringify!(frame_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplFrameStats),
            "::",
            stringify!(frame_height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_blocks) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplFrameStats),
            "::",
            stringify!(num_blocks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).block_stats_list) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplFrameStats),
            "::",
            stringify!(block_stats_list)
        )
    );
}
#[doc = "\\brief Temporal dependency model stats for each GOP before propagation"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VpxTplGopStats {
    #[doc = "< GOP size, also the size of frame_stats_list."]
    pub size: ::std::os::raw::c_int,
    #[doc = "< List of tpl stats for each frame"]
    pub frame_stats_list: *mut VpxTplFrameStats,
}
#[test]
fn bindgen_test_layout_VpxTplGopStats() {
    const UNINIT: ::std::mem::MaybeUninit<VpxTplGopStats> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<VpxTplGopStats>(),
        16usize,
        concat!("Size of: ", stringify!(VpxTplGopStats))
    );
    assert_eq!(
        ::std::mem::align_of::<VpxTplGopStats>(),
        8usize,
        concat!("Alignment of ", stringify!(VpxTplGopStats))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplGopStats),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_stats_list) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(VpxTplGopStats),
            "::",
            stringify!(frame_stats_list)
        )
    );
}
#[doc = " The external rate control doesn't determine anything.\n This mode is used as baseline."]
pub const vpx_rc_type_VPX_RC_NONE: vpx_rc_type = 0;
#[doc = " The external rate control model determines the quantization parameter (QP)\n for each frame."]
pub const vpx_rc_type_VPX_RC_QP: vpx_rc_type = 1;
#[doc = " The external rate control model determines the group of picture (GOP) of\n the video sequence."]
pub const vpx_rc_type_VPX_RC_GOP: vpx_rc_type = 2;
#[doc = " The external rate control model determines the rate-distortion multiplier\n (rdmult) for the current frame."]
pub const vpx_rc_type_VPX_RC_RDMULT: vpx_rc_type = 4;
#[doc = " The external rate control model determines both QP and GOP."]
pub const vpx_rc_type_VPX_RC_GOP_QP: vpx_rc_type = 3;
#[doc = " The external rate control model determines the QP, GOP and the rdmult."]
pub const vpx_rc_type_VPX_RC_GOP_QP_RDMULT: vpx_rc_type = 7;
#[doc = "\\brief The type of the external rate control.\n\n This controls what encoder parameters are determined by the external rate\n control."]
pub type vpx_rc_type = ::std::os::raw::c_int;
#[doc = "\\brief The type of the external rate control.\n\n This controls what encoder parameters are determined by the external rate\n control."]
pub use self::vpx_rc_type as vpx_rc_type_t;
pub const vpx_ext_rc_mode_VPX_RC_QMODE: vpx_ext_rc_mode = 0;
pub const vpx_ext_rc_mode_VPX_RC_VBR: vpx_ext_rc_mode = 1;
pub const vpx_ext_rc_mode_VPX_RC_CQ: vpx_ext_rc_mode = 2;
#[doc = "\\brief The rate control mode for the external rate control model."]
pub type vpx_ext_rc_mode = ::std::os::raw::c_int;
#[doc = "\\brief The rate control mode for the external rate control model."]
pub use self::vpx_ext_rc_mode as vpx_ext_rc_mode_t;
pub const vpx_rc_frame_update_type_VPX_RC_INVALID_UPDATE_TYPE: vpx_rc_frame_update_type = -1;
pub const vpx_rc_frame_update_type_VPX_RC_KF_UPDATE: vpx_rc_frame_update_type = 0;
pub const vpx_rc_frame_update_type_VPX_RC_LF_UPDATE: vpx_rc_frame_update_type = 1;
pub const vpx_rc_frame_update_type_VPX_RC_GF_UPDATE: vpx_rc_frame_update_type = 2;
pub const vpx_rc_frame_update_type_VPX_RC_ARF_UPDATE: vpx_rc_frame_update_type = 3;
pub const vpx_rc_frame_update_type_VPX_RC_OVERLAY_UPDATE: vpx_rc_frame_update_type = 4;
pub const vpx_rc_frame_update_type_VPX_RC_MID_OVERLAY_UPDATE: vpx_rc_frame_update_type = 5;
pub const vpx_rc_frame_update_type_VPX_RC_USE_BUF_FRAME: vpx_rc_frame_update_type = 6;
#[doc = "\\brief Corresponds to FRAME_UPDATE_TYPE defined in vp9_firstpass.h."]
pub type vpx_rc_frame_update_type = ::std::os::raw::c_int;
#[doc = "\\brief Corresponds to FRAME_UPDATE_TYPE defined in vp9_firstpass.h."]
pub use self::vpx_rc_frame_update_type as vpx_rc_frame_update_type_t;
pub const vpx_rc_ref_name_VPX_RC_INVALID_REF_FRAME: vpx_rc_ref_name = -1;
pub const vpx_rc_ref_name_VPX_RC_INTRA_FRAME: vpx_rc_ref_name = 0;
pub const vpx_rc_ref_name_VPX_RC_LAST_FRAME: vpx_rc_ref_name = 1;
pub const vpx_rc_ref_name_VPX_RC_GOLDEN_FRAME: vpx_rc_ref_name = 2;
pub const vpx_rc_ref_name_VPX_RC_ALTREF_FRAME: vpx_rc_ref_name = 3;
#[doc = "\\brief Name for the ref frames returned by the external RC.\n\n Corresponds to the ref frames defined in vp9_blockd.h."]
pub type vpx_rc_ref_name = ::std::os::raw::c_int;
#[doc = "\\brief Name for the ref frames returned by the external RC.\n\n Corresponds to the ref frames defined in vp9_blockd.h."]
pub use self::vpx_rc_ref_name as vpx_rc_ref_name_t;
#[doc = "\\brief Abstract rate control model handler\n\n The encoder will receive the model handler from\n vpx_rc_funcs_t::create_model()."]
pub type vpx_rc_model_t = *mut ::std::os::raw::c_void;
#[doc = "\\brief Superblock quantization parameters\n Store the superblock quantization parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sb_parameters {
    #[doc = "< Quantizer step index [0..255]"]
    pub q_index: ::std::os::raw::c_int,
    #[doc = "< Superblock level Lagrangian multiplier"]
    pub rdmult: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_sb_parameters() {
    const UNINIT: ::std::mem::MaybeUninit<sb_parameters> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sb_parameters>(),
        8usize,
        concat!("Size of: ", stringify!(sb_parameters))
    );
    assert_eq!(
        ::std::mem::align_of::<sb_parameters>(),
        4usize,
        concat!("Alignment of ", stringify!(sb_parameters))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).q_index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sb_parameters),
            "::",
            stringify!(q_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdmult) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sb_parameters),
            "::",
            stringify!(rdmult)
        )
    );
}
#[doc = "\\brief Superblock quantization parameters\n Store the superblock quantization parameters"]
pub type sb_params = sb_parameters;
#[doc = "\\brief Encode frame decision made by the external rate control model\n\n The encoder will receive the decision from the external rate control model\n through vpx_rc_funcs_t::get_encodeframe_decision()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_rc_encodeframe_decision {
    #[doc = "< Required: Quantizer step index [0..255]"]
    pub q_index: ::std::os::raw::c_int,
    #[doc = "< Required: Frame level Lagrangian multiplier"]
    pub rdmult: ::std::os::raw::c_int,
    #[doc = "< Required: Delta QP for UV"]
    pub delta_q_uv: ::std::os::raw::c_int,
    #[doc = " Optional: Superblock quantization parameters\n It is zero initialized by default. It will be set for key and ARF frames\n but not leaf frames."]
    pub sb_params_list: *mut sb_params,
}
#[test]
fn bindgen_test_layout_vpx_rc_encodeframe_decision() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_rc_encodeframe_decision> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_rc_encodeframe_decision>(),
        24usize,
        concat!("Size of: ", stringify!(vpx_rc_encodeframe_decision))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_rc_encodeframe_decision>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_rc_encodeframe_decision))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).q_index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_encodeframe_decision),
            "::",
            stringify!(q_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdmult) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_encodeframe_decision),
            "::",
            stringify!(rdmult)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delta_q_uv) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_encodeframe_decision),
            "::",
            stringify!(delta_q_uv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sb_params_list) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_encodeframe_decision),
            "::",
            stringify!(sb_params_list)
        )
    );
}
#[doc = "\\brief Encode frame decision made by the external rate control model\n\n The encoder will receive the decision from the external rate control model\n through vpx_rc_funcs_t::get_encodeframe_decision()."]
pub type vpx_rc_encodeframe_decision_t = vpx_rc_encodeframe_decision;
#[doc = "\\brief Information for the frame to be encoded.\n\n The encoder will send the information to external rate control model through\n vpx_rc_funcs_t::get_encodeframe_decision().\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_rc_encodeframe_info {
    #[doc = " 0: Key frame\n 1: Inter frame\n 2: Alternate reference frame\n 3: Overlay frame\n 4: Golden frame"]
    pub frame_type: ::std::os::raw::c_int,
    #[doc = "< display index, starts from zero"]
    pub show_index: ::std::os::raw::c_int,
    #[doc = "< coding index, starts from zero"]
    pub coding_index: ::std::os::raw::c_int,
    #[doc = " index of the current frame in this group of picture, starts from zero."]
    pub gop_index: ::std::os::raw::c_int,
    #[doc = "< three reference frames' coding indices"]
    pub ref_frame_coding_indexes: [::std::os::raw::c_int; 3usize],
    #[doc = " The validity of the three reference frames.\n 0: Invalid\n 1: Valid"]
    pub ref_frame_valid_list: [::std::os::raw::c_int; 3usize],
    #[doc = " The length of the current GOP."]
    pub gop_size: ::std::os::raw::c_int,
    #[doc = " Whether the current GOP uses an alt ref."]
    pub use_alt_ref: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_vpx_rc_encodeframe_info() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_rc_encodeframe_info> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_rc_encodeframe_info>(),
        48usize,
        concat!("Size of: ", stringify!(vpx_rc_encodeframe_info))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_rc_encodeframe_info>(),
        4usize,
        concat!("Alignment of ", stringify!(vpx_rc_encodeframe_info))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_encodeframe_info),
            "::",
            stringify!(frame_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).show_index) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_encodeframe_info),
            "::",
            stringify!(show_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coding_index) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_encodeframe_info),
            "::",
            stringify!(coding_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gop_index) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_encodeframe_info),
            "::",
            stringify!(gop_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ref_frame_coding_indexes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_encodeframe_info),
            "::",
            stringify!(ref_frame_coding_indexes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ref_frame_valid_list) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_encodeframe_info),
            "::",
            stringify!(ref_frame_valid_list)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gop_size) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_encodeframe_info),
            "::",
            stringify!(gop_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_alt_ref) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_encodeframe_info),
            "::",
            stringify!(use_alt_ref)
        )
    );
}
#[doc = "\\brief Information for the frame to be encoded.\n\n The encoder will send the information to external rate control model through\n vpx_rc_funcs_t::get_encodeframe_decision().\n"]
pub type vpx_rc_encodeframe_info_t = vpx_rc_encodeframe_info;
#[doc = "\\brief Frame coding result\n\n The encoder will send the result to the external rate control model through\n vpx_rc_funcs_t::update_encodeframe_result()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_rc_encodeframe_result {
    #[doc = "< number of bits spent on coding the frame"]
    pub bit_count: i64,
    #[doc = "< the actual qindex used to encode the frame"]
    pub actual_encoding_qindex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_vpx_rc_encodeframe_result() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_rc_encodeframe_result> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_rc_encodeframe_result>(),
        16usize,
        concat!("Size of: ", stringify!(vpx_rc_encodeframe_result))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_rc_encodeframe_result>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_rc_encodeframe_result))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bit_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_encodeframe_result),
            "::",
            stringify!(bit_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actual_encoding_qindex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_encodeframe_result),
            "::",
            stringify!(actual_encoding_qindex)
        )
    );
}
#[doc = "\\brief Frame coding result\n\n The encoder will send the result to the external rate control model through\n vpx_rc_funcs_t::update_encodeframe_result()."]
pub type vpx_rc_encodeframe_result_t = vpx_rc_encodeframe_result;
pub const vpx_rc_status_VPX_RC_OK: vpx_rc_status = 0;
pub const vpx_rc_status_VPX_RC_ERROR: vpx_rc_status = 1;
#[doc = "\\brief Status returned by rate control callback functions."]
pub type vpx_rc_status = ::std::os::raw::c_int;
#[doc = "\\brief Status returned by rate control callback functions."]
pub use self::vpx_rc_status as vpx_rc_status_t;
#[doc = "\\brief First pass frame stats\n This is a mirror of vp9's FIRSTPASS_STATS except that spatial_layer_id is\n omitted"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_rc_frame_stats {
    #[doc = " Frame number in display order, if stats are for a single frame.\n No real meaning for a collection of frames."]
    pub frame: f64,
    #[doc = " Weight assigned to this frame (or total weight for the collection of\n frames) currently based on intra factor and brightness factor. This is used\n to distribute bits between easier and harder frames."]
    pub weight: f64,
    #[doc = " Intra prediction error."]
    pub intra_error: f64,
    #[doc = " Best of intra pred error and inter pred error using last frame as ref."]
    pub coded_error: f64,
    #[doc = " Best of intra pred error and inter pred error using golden frame as ref."]
    pub sr_coded_error: f64,
    #[doc = " Estimate the noise energy of the current frame."]
    pub frame_noise_energy: f64,
    #[doc = " Percentage of blocks with inter pred error < intra pred error."]
    pub pcnt_inter: f64,
    #[doc = " Percentage of blocks using (inter prediction and) non-zero motion vectors."]
    pub pcnt_motion: f64,
    #[doc = " Percentage of blocks where golden frame was better than last or intra:\n inter pred error using golden frame < inter pred error using last frame and\n inter pred error using golden frame < intra pred error"]
    pub pcnt_second_ref: f64,
    #[doc = " Percentage of blocks where intra and inter prediction errors were very\n close."]
    pub pcnt_neutral: f64,
    #[doc = " Percentage of blocks that have intra error < inter error and inter error <\n LOW_I_THRESH\n - bit_depth 8: LOW_I_THRESH = 24000\n - bit_depth 10: LOW_I_THRESH = 24000 << 4\n - bit_depth 12: LOW_I_THRESH = 24000 << 8"]
    pub pcnt_intra_low: f64,
    #[doc = " Percentage of blocks that have intra error < inter error and intra error <\n LOW_I_THRESH but inter error >= LOW_I_THRESH LOW_I_THRESH\n - bit_depth 8: LOW_I_THRESH = 24000\n - bit_depth 10: LOW_I_THRESH = 24000 << 4\n - bit_depth 12: LOW_I_THRESH = 24000 << 8"]
    pub pcnt_intra_high: f64,
    #[doc = " Percentage of blocks that have almost no intra error residual\n (i.e. are in effect completely flat and untextured in the intra\n domain). In natural videos this is uncommon, but it is much more\n common in animations, graphics and screen content, so may be used\n as a signal to detect these types of content."]
    pub intra_skip_pct: f64,
    #[doc = " Percentage of blocks that have intra error < SMOOTH_INTRA_THRESH\n - bit_depth 8:  SMOOTH_INTRA_THRESH = 4000\n - bit_depth 10: SMOOTH_INTRA_THRESH = 4000 << 4\n - bit_depth 12: SMOOTH_INTRA_THRESH = 4000 << 8"]
    pub intra_smooth_pct: f64,
    #[doc = " Image mask rows top and bottom."]
    pub inactive_zone_rows: f64,
    #[doc = " Image mask columns at left and right edges."]
    pub inactive_zone_cols: f64,
    #[doc = " Mean of row motion vectors."]
    pub MVr: f64,
    #[doc = " Mean of absolute value of row motion vectors."]
    pub mvr_abs: f64,
    #[doc = " Mean of column motion vectors."]
    pub MVc: f64,
    #[doc = " Mean of absolute value of column motion vectors."]
    pub mvc_abs: f64,
    #[doc = " Variance of row motion vectors."]
    pub MVrv: f64,
    #[doc = " Variance of column motion vectors."]
    pub MVcv: f64,
    #[doc = " Value in range [-1,1] indicating fraction of row and column motion vectors\n that point inwards (negative MV value) or outwards (positive MV value).\n For example, value of 1 indicates, all row/column MVs are inwards."]
    pub mv_in_out_count: f64,
    #[doc = " Duration of the frame / collection of frames."]
    pub duration: f64,
    #[doc = " 1.0 if stats are for a single frame, or\n number of frames whose stats are accumulated."]
    pub count: f64,
    #[doc = " Number of new mv in a frame."]
    pub new_mv_count: f64,
}
#[test]
fn bindgen_test_layout_vpx_rc_frame_stats() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_rc_frame_stats> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_rc_frame_stats>(),
        208usize,
        concat!("Size of: ", stringify!(vpx_rc_frame_stats))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_rc_frame_stats>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_rc_frame_stats))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(frame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).weight) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(weight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).intra_error) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(intra_error)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coded_error) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(coded_error)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sr_coded_error) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(sr_coded_error)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_noise_energy) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(frame_noise_energy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pcnt_inter) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(pcnt_inter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pcnt_motion) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(pcnt_motion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pcnt_second_ref) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(pcnt_second_ref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pcnt_neutral) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(pcnt_neutral)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pcnt_intra_low) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(pcnt_intra_low)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pcnt_intra_high) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(pcnt_intra_high)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).intra_skip_pct) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(intra_skip_pct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).intra_smooth_pct) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(intra_smooth_pct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inactive_zone_rows) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(inactive_zone_rows)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inactive_zone_cols) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(inactive_zone_cols)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MVr) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(MVr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mvr_abs) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(mvr_abs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MVc) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(MVc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mvc_abs) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(mvc_abs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MVrv) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(MVrv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MVcv) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(MVcv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mv_in_out_count) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(mv_in_out_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).duration) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(duration)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).new_mv_count) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_frame_stats),
            "::",
            stringify!(new_mv_count)
        )
    );
}
#[doc = "\\brief First pass frame stats\n This is a mirror of vp9's FIRSTPASS_STATS except that spatial_layer_id is\n omitted"]
pub type vpx_rc_frame_stats_t = vpx_rc_frame_stats;
#[doc = "\\brief Collection of first pass frame stats"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_rc_firstpass_stats {
    #[doc = " Pointer to first pass frame stats.\n The pointed array of vpx_rc_frame_stats_t should have length equal to\n number of show frames in the video."]
    pub frame_stats: *mut vpx_rc_frame_stats_t,
    #[doc = " Number of show frames in the video."]
    pub num_frames: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_vpx_rc_firstpass_stats() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_rc_firstpass_stats> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_rc_firstpass_stats>(),
        16usize,
        concat!("Size of: ", stringify!(vpx_rc_firstpass_stats))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_rc_firstpass_stats>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_rc_firstpass_stats))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_stats) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_firstpass_stats),
            "::",
            stringify!(frame_stats)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_frames) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_firstpass_stats),
            "::",
            stringify!(num_frames)
        )
    );
}
#[doc = "\\brief Collection of first pass frame stats"]
pub type vpx_rc_firstpass_stats_t = vpx_rc_firstpass_stats;
#[doc = "\\brief Encode config sent to external rate control model"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_rc_config {
    #[doc = "< frame width"]
    pub frame_width: ::std::os::raw::c_int,
    #[doc = "< frame height"]
    pub frame_height: ::std::os::raw::c_int,
    #[doc = "< number of visible frames in the video"]
    pub show_frame_count: ::std::os::raw::c_int,
    #[doc = "< max GOP size in number of show frames"]
    pub max_gf_interval: ::std::os::raw::c_int,
    #[doc = "< min GOP size in number of show frames"]
    pub min_gf_interval: ::std::os::raw::c_int,
    #[doc = " Target bitrate in kilobytes per second"]
    pub target_bitrate_kbps: ::std::os::raw::c_int,
    #[doc = "< numerator of frame rate"]
    pub frame_rate_num: ::std::os::raw::c_int,
    #[doc = "< denominator of frame rate"]
    pub frame_rate_den: ::std::os::raw::c_int,
    #[doc = "< Q mode or VBR mode"]
    pub rc_mode: vpx_ext_rc_mode_t,
    #[doc = "< for VBR mode only"]
    pub overshoot_percent: ::std::os::raw::c_int,
    #[doc = "< for VBR mode only"]
    pub undershoot_percent: ::std::os::raw::c_int,
    #[doc = "< for VBR mode only"]
    pub min_base_q_index: ::std::os::raw::c_int,
    #[doc = "< for VBR mode only"]
    pub max_base_q_index: ::std::os::raw::c_int,
    #[doc = "< base QP for leaf frames, 0-255"]
    pub base_qp: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_vpx_rc_config() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_rc_config> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_rc_config>(),
        56usize,
        concat!("Size of: ", stringify!(vpx_rc_config))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_rc_config>(),
        4usize,
        concat!("Alignment of ", stringify!(vpx_rc_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_width) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_config),
            "::",
            stringify!(frame_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_config),
            "::",
            stringify!(frame_height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).show_frame_count) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_config),
            "::",
            stringify!(show_frame_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_gf_interval) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_config),
            "::",
            stringify!(max_gf_interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_gf_interval) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_config),
            "::",
            stringify!(min_gf_interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_bitrate_kbps) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_config),
            "::",
            stringify!(target_bitrate_kbps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_rate_num) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_config),
            "::",
            stringify!(frame_rate_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_rate_den) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_config),
            "::",
            stringify!(frame_rate_den)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rc_mode) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_config),
            "::",
            stringify!(rc_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).overshoot_percent) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_config),
            "::",
            stringify!(overshoot_percent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).undershoot_percent) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_config),
            "::",
            stringify!(undershoot_percent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_base_q_index) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_config),
            "::",
            stringify!(min_base_q_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_base_q_index) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_config),
            "::",
            stringify!(max_base_q_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base_qp) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_config),
            "::",
            stringify!(base_qp)
        )
    );
}
#[doc = "\\brief Encode config sent to external rate control model"]
pub type vpx_rc_config_t = vpx_rc_config;
#[doc = "\\brief Control what ref frame to use and its index."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_rc_ref_frame {
    #[doc = " Ref frame index. Corresponding to |lst_fb_idx|, |gld_fb_idx| or\n |alt_fb_idx| in VP9_COMP depending on the ref frame #name."]
    pub index: [::std::os::raw::c_int; 4usize],
    #[doc = " Ref frame name. This decides whether the #index is used as\n |lst_fb_idx|, |gld_fb_idx| or |alt_fb_idx| in VP9_COMP.\n"]
    pub name: [vpx_rc_ref_name_t; 4usize],
}
#[test]
fn bindgen_test_layout_vpx_rc_ref_frame() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_rc_ref_frame> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_rc_ref_frame>(),
        32usize,
        concat!("Size of: ", stringify!(vpx_rc_ref_frame))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_rc_ref_frame>(),
        4usize,
        concat!("Alignment of ", stringify!(vpx_rc_ref_frame))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_ref_frame),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_ref_frame),
            "::",
            stringify!(name)
        )
    );
}
#[doc = "\\brief Control what ref frame to use and its index."]
pub type vpx_rc_ref_frame_t = vpx_rc_ref_frame;
#[doc = "\\brief The decision made by the external rate control model to set the\n group of picture."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_rc_gop_decision {
    #[doc = "< The number of frames of this GOP"]
    pub gop_coding_frames: ::std::os::raw::c_int,
    #[doc = "< Whether to use alt ref for this GOP"]
    pub use_alt_ref: ::std::os::raw::c_int,
    #[doc = "< Whether to set key frame for this GOP"]
    pub use_key_frame: ::std::os::raw::c_int,
    #[doc = " Frame type for each frame in this GOP.\n This will be populated to |update_type| in GF_GROUP defined in\n vp9_firstpass.h"]
    pub update_type: [vpx_rc_frame_update_type_t; 252usize],
    #[doc = " Ref frame buffer index to be updated for each frame in this GOP."]
    pub update_ref_index: [::std::os::raw::c_int; 252usize],
    #[doc = " Ref frame list to be used for each frame in this GOP."]
    pub ref_frame_list: [vpx_rc_ref_frame_t; 252usize],
}
#[test]
fn bindgen_test_layout_vpx_rc_gop_decision() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_rc_gop_decision> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_rc_gop_decision>(),
        10092usize,
        concat!("Size of: ", stringify!(vpx_rc_gop_decision))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_rc_gop_decision>(),
        4usize,
        concat!("Alignment of ", stringify!(vpx_rc_gop_decision))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gop_coding_frames) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_gop_decision),
            "::",
            stringify!(gop_coding_frames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_alt_ref) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_gop_decision),
            "::",
            stringify!(use_alt_ref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_key_frame) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_gop_decision),
            "::",
            stringify!(use_key_frame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).update_type) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_gop_decision),
            "::",
            stringify!(update_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).update_ref_index) as usize - ptr as usize },
        1020usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_gop_decision),
            "::",
            stringify!(update_ref_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ref_frame_list) as usize - ptr as usize },
        2028usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_gop_decision),
            "::",
            stringify!(ref_frame_list)
        )
    );
}
#[doc = "\\brief The decision made by the external rate control model to set the\n group of picture."]
pub type vpx_rc_gop_decision_t = vpx_rc_gop_decision;
#[doc = "\\brief The decision made by the external rate control model to set the\n key frame location and the show frame count in the key frame group"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_rc_key_frame_decision {
    #[doc = "< This key frame's show index in the video"]
    pub key_frame_show_index: ::std::os::raw::c_int,
    #[doc = "< Show frame count of this key frame group"]
    pub key_frame_group_size: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_vpx_rc_key_frame_decision() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_rc_key_frame_decision> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_rc_key_frame_decision>(),
        8usize,
        concat!("Size of: ", stringify!(vpx_rc_key_frame_decision))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_rc_key_frame_decision>(),
        4usize,
        concat!("Alignment of ", stringify!(vpx_rc_key_frame_decision))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_frame_show_index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_key_frame_decision),
            "::",
            stringify!(key_frame_show_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_frame_group_size) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_key_frame_decision),
            "::",
            stringify!(key_frame_group_size)
        )
    );
}
#[doc = "\\brief The decision made by the external rate control model to set the\n key frame location and the show frame count in the key frame group"]
pub type vpx_rc_key_frame_decision_t = vpx_rc_key_frame_decision;
#[doc = "\\brief Create an external rate control model callback prototype\n\n This callback is invoked by the encoder to create an external rate control\n model.\n\n \\param[in]  priv                Callback's private data\n \\param[in]  ratectrl_config     Pointer to vpx_rc_config_t\n \\param[out] rate_ctrl_model_ptr Pointer to vpx_rc_model_t"]
pub type vpx_rc_create_model_cb_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        priv_: *mut ::std::os::raw::c_void,
        ratectrl_config: *const vpx_rc_config_t,
        rate_ctrl_model_ptr: *mut vpx_rc_model_t,
    ) -> vpx_rc_status_t,
>;
#[doc = "\\brief Send first pass stats to the external rate control model callback\n prototype\n\n This callback is invoked by the encoder to send first pass stats to the\n external rate control model.\n\n \\param[in]  rate_ctrl_model    rate control model\n \\param[in]  first_pass_stats   first pass stats"]
pub type vpx_rc_send_firstpass_stats_cb_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        rate_ctrl_model: vpx_rc_model_t,
        first_pass_stats: *const vpx_rc_firstpass_stats_t,
    ) -> vpx_rc_status_t,
>;
#[doc = "\\brief Send TPL stats for the current GOP to the external rate control model\n callback prototype\n\n This callback is invoked by the encoder to send TPL stats for the GOP to the\n external rate control model.\n\n \\param[in]  rate_ctrl_model  rate control model\n \\param[in]  tpl_gop_stats    TPL stats for current GOP"]
pub type vpx_rc_send_tpl_gop_stats_cb_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        rate_ctrl_model: vpx_rc_model_t,
        tpl_gop_stats: *const VpxTplGopStats,
    ) -> vpx_rc_status_t,
>;
#[doc = "\\brief Receive encode frame decision callback prototype\n\n This callback is invoked by the encoder to receive encode frame decision from\n the external rate control model.\n\n \\param[in]  rate_ctrl_model    rate control model\n \\param[in]  frame_gop_index    index of the frame in current gop\n \\param[out] frame_decision     encode decision of the coding frame"]
pub type vpx_rc_get_encodeframe_decision_cb_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        rate_ctrl_model: vpx_rc_model_t,
        frame_gop_index: ::std::os::raw::c_int,
        frame_decision: *mut vpx_rc_encodeframe_decision_t,
    ) -> vpx_rc_status_t,
>;
#[doc = "\\brief Update encode frame result callback prototype\n\n This callback is invoked by the encoder to update encode frame result to the\n external rate control model.\n\n \\param[in]  rate_ctrl_model     rate control model\n \\param[out] encode_frame_result encode result of the coding frame"]
pub type vpx_rc_update_encodeframe_result_cb_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        rate_ctrl_model: vpx_rc_model_t,
        encode_frame_result: *const vpx_rc_encodeframe_result_t,
    ) -> vpx_rc_status_t,
>;
#[doc = "\\brief Get the key frame decision from the external rate control model.\n\n This callback is invoked by the encoder to get key frame decision from\n the external rate control model.\n\n \\param[in]  rate_ctrl_model    rate control model\n \\param[out] key_frame_decision key frame decision from the model"]
pub type vpx_rc_get_key_frame_decision_cb_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        rate_ctrl_model: vpx_rc_model_t,
        key_frame_decision: *mut vpx_rc_key_frame_decision_t,
    ) -> vpx_rc_status_t,
>;
#[doc = "\\brief Get the GOP structure from the external rate control model.\n\n This callback is invoked by the encoder to get GOP decisions from\n the external rate control model.\n\n \\param[in]  rate_ctrl_model  rate control model\n \\param[out] gop_decision     GOP decision from the model"]
pub type vpx_rc_get_gop_decision_cb_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        rate_ctrl_model: vpx_rc_model_t,
        gop_decision: *mut vpx_rc_gop_decision_t,
    ) -> vpx_rc_status_t,
>;
#[doc = "\\brief Get the frame rdmult from the external rate control model.\n\n This callback is invoked by the encoder to get rdmult from\n the external rate control model.\n\n \\param[in]  rate_ctrl_model  rate control model\n \\param[in]  frame_info       information collected from the encoder\n \\param[out] rdmult           frame rate-distortion multiplier from the model"]
pub type vpx_rc_get_frame_rdmult_cb_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        rate_ctrl_model: vpx_rc_model_t,
        frame_info: *const vpx_rc_encodeframe_info_t,
        rdmult: *mut ::std::os::raw::c_int,
    ) -> vpx_rc_status_t,
>;
#[doc = "\\brief Delete the external rate control model callback prototype\n\n This callback is invoked by the encoder to delete the external rate control\n model.\n\n \\param[in]  rate_ctrl_model     rate control model"]
pub type vpx_rc_delete_model_cb_fn_t =
    ::std::option::Option<unsafe extern "C" fn(rate_ctrl_model: vpx_rc_model_t) -> vpx_rc_status_t>;
#[doc = "\\brief Callback function set for external rate control.\n\n The user can enable external rate control by registering\n a set of callback functions with the codec control flag\n #VP9E_SET_EXTERNAL_RATE_CONTROL."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_rc_funcs {
    #[doc = " The rate control type of this API."]
    pub rc_type: vpx_rc_type_t,
    #[doc = " Create an external rate control model."]
    pub create_model: vpx_rc_create_model_cb_fn_t,
    #[doc = " Send first pass stats to the external rate control model."]
    pub send_firstpass_stats: vpx_rc_send_firstpass_stats_cb_fn_t,
    #[doc = " Send TPL stats for current GOP to the external rate control model."]
    pub send_tpl_gop_stats: vpx_rc_send_tpl_gop_stats_cb_fn_t,
    #[doc = " Get encodeframe decision from the external rate control model."]
    pub get_encodeframe_decision: vpx_rc_get_encodeframe_decision_cb_fn_t,
    #[doc = " Update encodeframe result to the external rate control model."]
    pub update_encodeframe_result: vpx_rc_update_encodeframe_result_cb_fn_t,
    #[doc = " Get key frame decision from the external rate control model."]
    pub get_key_frame_decision: vpx_rc_get_key_frame_decision_cb_fn_t,
    #[doc = " Get GOP decisions from the external rate control model."]
    pub get_gop_decision: vpx_rc_get_gop_decision_cb_fn_t,
    #[doc = " Get rdmult for the frame from the external rate control model."]
    pub get_frame_rdmult: vpx_rc_get_frame_rdmult_cb_fn_t,
    #[doc = " Delete the external rate control model."]
    pub delete_model: vpx_rc_delete_model_cb_fn_t,
    #[doc = " Rate control log path."]
    pub rate_ctrl_log_path: *const ::std::os::raw::c_char,
    #[doc = " Private data for the external rate control model."]
    pub priv_: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_vpx_rc_funcs() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_rc_funcs> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_rc_funcs>(),
        96usize,
        concat!("Size of: ", stringify!(vpx_rc_funcs))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_rc_funcs>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_rc_funcs))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rc_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_funcs),
            "::",
            stringify!(rc_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).create_model) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_funcs),
            "::",
            stringify!(create_model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_firstpass_stats) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_funcs),
            "::",
            stringify!(send_firstpass_stats)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_tpl_gop_stats) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_funcs),
            "::",
            stringify!(send_tpl_gop_stats)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_encodeframe_decision) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_funcs),
            "::",
            stringify!(get_encodeframe_decision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).update_encodeframe_result) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_funcs),
            "::",
            stringify!(update_encodeframe_result)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_key_frame_decision) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_funcs),
            "::",
            stringify!(get_key_frame_decision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_gop_decision) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_funcs),
            "::",
            stringify!(get_gop_decision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_frame_rdmult) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_funcs),
            "::",
            stringify!(get_frame_rdmult)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delete_model) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_funcs),
            "::",
            stringify!(delete_model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rate_ctrl_log_path) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_funcs),
            "::",
            stringify!(rate_ctrl_log_path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priv_) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rc_funcs),
            "::",
            stringify!(priv_)
        )
    );
}
#[doc = "\\brief Callback function set for external rate control.\n\n The user can enable external rate control by registering\n a set of callback functions with the codec control flag\n #VP9E_SET_EXTERNAL_RATE_CONTROL."]
pub type vpx_rc_funcs_t = vpx_rc_funcs;
#[doc = "\\brief Generic fixed size buffer structure\n\n This structure is able to hold a reference to any fixed size buffer."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_fixed_buf {
    #[doc = "< Pointer to the data"]
    pub buf: *mut ::std::os::raw::c_void,
    #[doc = "< Length of the buffer, in chars"]
    pub sz: usize,
}
#[test]
fn bindgen_test_layout_vpx_fixed_buf() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_fixed_buf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_fixed_buf>(),
        16usize,
        concat!("Size of: ", stringify!(vpx_fixed_buf))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_fixed_buf>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_fixed_buf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_fixed_buf),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sz) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_fixed_buf),
            "::",
            stringify!(sz)
        )
    );
}
#[doc = "\\brief Generic fixed size buffer structure\n\n This structure is able to hold a reference to any fixed size buffer."]
pub type vpx_fixed_buf_t = vpx_fixed_buf;
#[doc = "\\brief Time Stamp Type\n\n An integer, which when multiplied by the stream's time base, provides\n the absolute time of a sample."]
pub type vpx_codec_pts_t = i64;
#[doc = "\\brief Compressed Frame Flags\n\n This type represents a bitfield containing information about a compressed\n frame that may be useful to an application. The most significant 16 bits\n can be used by an algorithm to provide additional detail, for example to\n support frame types that are codec specific (MPEG-1 D-frames for example)"]
pub type vpx_codec_frame_flags_t = u32;
#[doc = "\\brief Error Resilient flags\n\n These flags define which error resilient features to enable in the\n encoder. The flags are specified through the\n vpx_codec_enc_cfg::g_error_resilient variable."]
pub type vpx_codec_er_flags_t = u32;
#[doc = "< Compressed video frame"]
pub const vpx_codec_cx_pkt_kind_VPX_CODEC_CX_FRAME_PKT: vpx_codec_cx_pkt_kind = 0;
#[doc = "< Two-pass statistics for this frame"]
pub const vpx_codec_cx_pkt_kind_VPX_CODEC_STATS_PKT: vpx_codec_cx_pkt_kind = 1;
#[doc = "< first pass mb statistics for this frame"]
pub const vpx_codec_cx_pkt_kind_VPX_CODEC_FPMB_STATS_PKT: vpx_codec_cx_pkt_kind = 2;
#[doc = "< PSNR statistics for this frame"]
pub const vpx_codec_cx_pkt_kind_VPX_CODEC_PSNR_PKT: vpx_codec_cx_pkt_kind = 3;
#[doc = "< Algorithm extensions"]
pub const vpx_codec_cx_pkt_kind_VPX_CODEC_CUSTOM_PKT: vpx_codec_cx_pkt_kind = 256;
#[doc = "\\brief Encoder output packet variants\n\n This enumeration lists the different kinds of data packets that can be\n returned by calls to vpx_codec_get_cx_data(). Algorithms \\ref MAY\n extend this list to provide additional functionality."]
pub type vpx_codec_cx_pkt_kind = ::std::os::raw::c_int;
#[doc = "\\brief Encoder output packet\n\n This structure contains the different kinds of output data the encoder\n may produce while compressing a frame."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct vpx_codec_cx_pkt {
    #[doc = "< packet variant"]
    pub kind: vpx_codec_cx_pkt_kind,
    #[doc = "< packet data"]
    pub data: vpx_codec_cx_pkt__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vpx_codec_cx_pkt__bindgen_ty_1 {
    #[doc = "< data for compressed frame packet"]
    pub frame: vpx_codec_cx_pkt__bindgen_ty_1__bindgen_ty_1,
    #[doc = "< data for two-pass packet"]
    pub twopass_stats: vpx_fixed_buf_t,
    #[doc = "< first pass mb packet"]
    pub firstpass_mb_stats: vpx_fixed_buf_t,
    #[doc = "< data for PSNR packet"]
    pub psnr: vpx_codec_cx_pkt__bindgen_ty_1_vpx_psnr_pkt,
    #[doc = "< data for arbitrary packets"]
    pub raw: vpx_fixed_buf_t,
    #[doc = "< fixed sz"]
    pub pad: [::std::os::raw::c_char; 124usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_codec_cx_pkt__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "< compressed data buffer"]
    pub buf: *mut ::std::os::raw::c_void,
    #[doc = "< length of compressed data"]
    pub sz: usize,
    #[doc = "\\brief time stamp to show frame (in timebase units)"]
    pub pts: vpx_codec_pts_t,
    #[doc = "\\brief duration to show frame (in timebase units)"]
    pub duration: ::std::os::raw::c_ulong,
    #[doc = "< flags for this frame"]
    pub flags: vpx_codec_frame_flags_t,
    #[doc = "\\brief the partition id defines the decoding order of the partitions.\n Only applicable when \"output partition\" mode is enabled. First\n partition has id 0."]
    pub partition_id: ::std::os::raw::c_int,
    #[doc = "< frame width"]
    pub width: [::std::os::raw::c_uint; 5usize],
    #[doc = "< frame height"]
    pub height: [::std::os::raw::c_uint; 5usize],
    #[doc = "\\brief Flag to indicate if spatial layer frame in this packet is\n encoded or dropped. VP8 will always be set to 1."]
    pub spatial_layer_encoded: [u8; 5usize],
}
#[test]
fn bindgen_test_layout_vpx_codec_cx_pkt__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_codec_cx_pkt__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_codec_cx_pkt__bindgen_ty_1__bindgen_ty_1>(),
        88usize,
        concat!(
            "Size of: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_codec_cx_pkt__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sz) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(sz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pts) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(pts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).duration) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(duration)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).partition_id) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(partition_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spatial_layer_encoded) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(spatial_layer_encoded)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_codec_cx_pkt__bindgen_ty_1_vpx_psnr_pkt {
    #[doc = "< Number of samples, total/y/u/v"]
    pub samples: [::std::os::raw::c_uint; 4usize],
    #[doc = "< sum squared error, total/y/u/v"]
    pub sse: [u64; 4usize],
    #[doc = "< PSNR, total/y/u/v"]
    pub psnr: [f64; 4usize],
    #[doc = "< Spatial layer id"]
    pub spatial_layer_id: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_vpx_codec_cx_pkt__bindgen_ty_1_vpx_psnr_pkt() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_codec_cx_pkt__bindgen_ty_1_vpx_psnr_pkt> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_codec_cx_pkt__bindgen_ty_1_vpx_psnr_pkt>(),
        88usize,
        concat!(
            "Size of: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1_vpx_psnr_pkt)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_codec_cx_pkt__bindgen_ty_1_vpx_psnr_pkt>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1_vpx_psnr_pkt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).samples) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1_vpx_psnr_pkt),
            "::",
            stringify!(samples)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sse) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1_vpx_psnr_pkt),
            "::",
            stringify!(sse)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).psnr) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1_vpx_psnr_pkt),
            "::",
            stringify!(psnr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spatial_layer_id) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1_vpx_psnr_pkt),
            "::",
            stringify!(spatial_layer_id)
        )
    );
}
#[test]
fn bindgen_test_layout_vpx_codec_cx_pkt__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_codec_cx_pkt__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_codec_cx_pkt__bindgen_ty_1>(),
        128usize,
        concat!("Size of: ", stringify!(vpx_codec_cx_pkt__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_codec_cx_pkt__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_codec_cx_pkt__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1),
            "::",
            stringify!(frame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).twopass_stats) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1),
            "::",
            stringify!(twopass_stats)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).firstpass_mb_stats) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1),
            "::",
            stringify!(firstpass_mb_stats)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).psnr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1),
            "::",
            stringify!(psnr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).raw) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1),
            "::",
            stringify!(raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt__bindgen_ty_1),
            "::",
            stringify!(pad)
        )
    );
}
#[test]
fn bindgen_test_layout_vpx_codec_cx_pkt() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_codec_cx_pkt> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_codec_cx_pkt>(),
        136usize,
        concat!("Size of: ", stringify!(vpx_codec_cx_pkt))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_codec_cx_pkt>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_codec_cx_pkt))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).kind) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_cx_pkt),
            "::",
            stringify!(data)
        )
    );
}
#[doc = "\\brief Encoder output packet\n\n This structure contains the different kinds of output data the encoder\n may produce while compressing a frame."]
pub type vpx_codec_cx_pkt_t = vpx_codec_cx_pkt;
#[doc = "\\brief Encoder return output buffer callback\n\n This callback function, when registered, returns with packets when each\n spatial layer is encoded."]
pub type vpx_codec_enc_output_cx_pkt_cb_fn_t = ::std::option::Option<
    unsafe extern "C" fn(pkt: *mut vpx_codec_cx_pkt_t, user_data: *mut ::std::os::raw::c_void),
>;
#[doc = "\\brief Callback function pointer / user data pair storage"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_codec_enc_output_cx_cb_pair {
    #[doc = "< Callback function"]
    pub output_cx_pkt: vpx_codec_enc_output_cx_pkt_cb_fn_t,
    #[doc = "< Pointer to private data"]
    pub user_priv: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_vpx_codec_enc_output_cx_cb_pair() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_codec_enc_output_cx_cb_pair> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_codec_enc_output_cx_cb_pair>(),
        16usize,
        concat!("Size of: ", stringify!(vpx_codec_enc_output_cx_cb_pair))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_codec_enc_output_cx_cb_pair>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_codec_enc_output_cx_cb_pair))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).output_cx_pkt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_enc_output_cx_cb_pair),
            "::",
            stringify!(output_cx_pkt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user_priv) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_enc_output_cx_cb_pair),
            "::",
            stringify!(user_priv)
        )
    );
}
#[doc = "\\brief Callback function pointer / user data pair storage"]
pub type vpx_codec_priv_output_cx_pkt_cb_pair_t = vpx_codec_enc_output_cx_cb_pair;
#[doc = "\\brief Rational Number\n\n This structure holds a fractional value."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_rational {
    #[doc = "< fraction numerator"]
    pub num: ::std::os::raw::c_int,
    #[doc = "< fraction denominator"]
    pub den: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_vpx_rational() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_rational> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_rational>(),
        8usize,
        concat!("Size of: ", stringify!(vpx_rational))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_rational>(),
        4usize,
        concat!("Alignment of ", stringify!(vpx_rational))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rational),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).den) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_rational),
            "::",
            stringify!(den)
        )
    );
}
#[doc = "\\brief Rational Number\n\n This structure holds a fractional value."]
pub type vpx_rational_t = vpx_rational;
#[doc = "< Single pass mode"]
pub const vpx_enc_pass_VPX_RC_ONE_PASS: vpx_enc_pass = 0;
#[doc = "< First pass of multi-pass mode"]
pub const vpx_enc_pass_VPX_RC_FIRST_PASS: vpx_enc_pass = 1;
#[doc = "< Final pass of multi-pass mode"]
pub const vpx_enc_pass_VPX_RC_LAST_PASS: vpx_enc_pass = 2;
#[doc = "\\brief Multi-pass Encoding Pass"]
pub type vpx_enc_pass = ::std::os::raw::c_int;
#[doc = "< Variable Bit Rate (VBR) mode"]
pub const vpx_rc_mode_VPX_VBR: vpx_rc_mode = 0;
#[doc = "< Constant Bit Rate (CBR) mode"]
pub const vpx_rc_mode_VPX_CBR: vpx_rc_mode = 1;
#[doc = "< Constrained Quality (CQ)  mode"]
pub const vpx_rc_mode_VPX_CQ: vpx_rc_mode = 2;
#[doc = "< Constant Quality (Q) mode"]
pub const vpx_rc_mode_VPX_Q: vpx_rc_mode = 3;
#[doc = "\\brief Rate control mode"]
pub type vpx_rc_mode = ::std::os::raw::c_int;
#[doc = "< deprecated, implies VPX_KF_DISABLED"]
pub const vpx_kf_mode_VPX_KF_FIXED: vpx_kf_mode = 0;
#[doc = "< Encoder determines optimal placement automatically"]
pub const vpx_kf_mode_VPX_KF_AUTO: vpx_kf_mode = 1;
#[doc = "< Encoder does not place keyframes."]
pub const vpx_kf_mode_VPX_KF_DISABLED: vpx_kf_mode = 0;
#[doc = "\\brief Keyframe placement mode.\n\n This enumeration determines whether keyframes are placed automatically by\n the encoder or whether this behavior is disabled. Older releases of this\n SDK were implemented such that VPX_KF_FIXED meant keyframes were disabled.\n This name is confusing for this behavior, so the new symbols to be used\n are VPX_KF_AUTO and VPX_KF_DISABLED."]
pub type vpx_kf_mode = ::std::os::raw::c_int;
#[doc = "\\brief Encoded Frame Flags\n\n This type indicates a bitfield to be passed to vpx_codec_encode(), defining\n per-frame boolean values. By convention, bits common to all codecs will be\n named VPX_EFLAG_*, and bits specific to an algorithm will be named\n /algo/_eflag_*. The lower order 16 bits are reserved for common use."]
pub type vpx_enc_frame_flags_t = ::std::os::raw::c_long;
#[doc = "\\brief Encoder configuration structure\n\n This structure contains the encoder settings that have common representations\n across all codecs. This doesn't imply that all codecs support all features,\n however."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_codec_enc_cfg {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_vpx_codec_enc_cfg() {
    assert_eq!(
        ::std::mem::size_of::<vpx_codec_enc_cfg>(),
        504usize,
        concat!("Size of: ", stringify!(vpx_codec_enc_cfg))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_codec_enc_cfg>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_codec_enc_cfg))
    );
}
#[doc = "\\brief Encoder configuration structure\n\n This structure contains the encoder settings that have common representations\n across all codecs. This doesn't imply that all codecs support all features,\n however."]
pub type vpx_codec_enc_cfg_t = vpx_codec_enc_cfg;
#[doc = "\\brief  vp9 svc extra configure parameters\n\n This defines max/min quantizers and scale factors for each layer\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_svc_parameters {
    #[doc = "< Max Q for each layer"]
    pub max_quantizers: [::std::os::raw::c_int; 12usize],
    #[doc = "< Min Q for each layer"]
    pub min_quantizers: [::std::os::raw::c_int; 12usize],
    #[doc = "< Scaling factor-numerator"]
    pub scaling_factor_num: [::std::os::raw::c_int; 12usize],
    #[doc = "< Scaling factor-denominator"]
    pub scaling_factor_den: [::std::os::raw::c_int; 12usize],
    #[doc = "< Speed setting for each sl"]
    pub speed_per_layer: [::std::os::raw::c_int; 12usize],
    #[doc = "< Temporal layering mode"]
    pub temporal_layering_mode: ::std::os::raw::c_int,
    #[doc = "< Loopfilter ctrl for each sl"]
    pub loopfilter_ctrl: [::std::os::raw::c_int; 12usize],
}
#[test]
fn bindgen_test_layout_vpx_svc_parameters() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_svc_parameters> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_svc_parameters>(),
        292usize,
        concat!("Size of: ", stringify!(vpx_svc_parameters))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_svc_parameters>(),
        4usize,
        concat!("Alignment of ", stringify!(vpx_svc_parameters))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_quantizers) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_parameters),
            "::",
            stringify!(max_quantizers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_quantizers) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_parameters),
            "::",
            stringify!(min_quantizers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scaling_factor_num) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_parameters),
            "::",
            stringify!(scaling_factor_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scaling_factor_den) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_parameters),
            "::",
            stringify!(scaling_factor_den)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).speed_per_layer) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_parameters),
            "::",
            stringify!(speed_per_layer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).temporal_layering_mode) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_parameters),
            "::",
            stringify!(temporal_layering_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loopfilter_ctrl) as usize - ptr as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_parameters),
            "::",
            stringify!(loopfilter_ctrl)
        )
    );
}
#[doc = "\\brief  vp9 svc extra configure parameters\n\n This defines max/min quantizers and scale factors for each layer\n"]
pub type vpx_svc_extra_cfg_t = vpx_svc_parameters;
extern "C" {
    #[doc = "\\brief Initialize an encoder instance\n\n Initializes an encoder context using the given interface. Applications\n should call the vpx_codec_enc_init convenience macro instead of this\n function directly, to ensure that the ABI version number parameter\n is properly initialized.\n\n If the library was configured with --disable-multithread, this call\n is not thread safe and should be guarded with a lock if being used\n in a multithreaded context.\n\n If vpx_codec_enc_init_ver() fails, it is not necessary to call\n vpx_codec_destroy() on the encoder context.\n\n \\param[in]    ctx     Pointer to this instance's context.\n \\param[in]    iface   Pointer to the algorithm interface to use.\n \\param[in]    cfg     Configuration to use.\n \\param[in]    flags   Bitfield of VPX_CODEC_USE_* flags\n \\param[in]    ver     ABI version number. Must be set to\n                       VPX_ENCODER_ABI_VERSION\n \\retval #VPX_CODEC_OK\n     The decoder algorithm initialized.\n \\retval #VPX_CODEC_MEM_ERROR\n     Memory allocation failed."]
    pub fn vpx_codec_enc_init_ver(
        ctx: *mut vpx_codec_ctx_t,
        iface: *const vpx_codec_iface,
        cfg: *const vpx_codec_enc_cfg_t,
        flags: vpx_codec_flags_t,
        ver: ::std::os::raw::c_int,
    ) -> vpx_codec_err_t;
}
extern "C" {
    #[doc = "\\brief Initialize multi-encoder instance\n\n Initializes multiple encoder contexts using the given interface.\n Applications should call the vpx_codec_enc_init_multi convenience macro\n instead of this function directly, to ensure that the ABI version number\n parameter is properly initialized.\n\n \\param[in]    ctx     Pointer to an array of num_enc instances' contexts.\n \\param[in]    iface   Pointer to the algorithm interface to use.\n \\param[in]    cfg     An array of num_enc configurations to use.\n \\param[in]    num_enc Total number of encoders.\n \\param[in]    flags   Bitfield of VPX_CODEC_USE_* flags\n \\param[in]    dsf     Pointer to an array of num_enc down-sampling factors.\n \\param[in]    ver     ABI version number. Must be set to\n                       VPX_ENCODER_ABI_VERSION\n \\retval #VPX_CODEC_OK\n     The encoder algorithm has been initialized.\n \\retval #VPX_CODEC_MEM_ERROR\n     Memory allocation failed.\n\n \\note\n This is only supported by VP8. iface must point to the interface to the VP8\n encoder."]
    pub fn vpx_codec_enc_init_multi_ver(
        ctx: *mut vpx_codec_ctx_t,
        iface: *const vpx_codec_iface,
        cfg: *const vpx_codec_enc_cfg_t,
        num_enc: ::std::os::raw::c_int,
        flags: vpx_codec_flags_t,
        dsf: *const vpx_rational_t,
        ver: ::std::os::raw::c_int,
    ) -> vpx_codec_err_t;
}
extern "C" {
    #[doc = "\\brief Get a default configuration\n\n Initializes a encoder configuration structure with default values. Supports\n the notion of \"usages\" so that an algorithm may offer different default\n settings depending on the user's intended goal. This function \\ref SHOULD\n be called by all applications to initialize the configuration structure\n before specializing the configuration with application specific values.\n\n \\param[in]    iface     Pointer to the algorithm interface to use.\n \\param[out]   cfg       Configuration buffer to populate.\n \\param[in]    usage     Must be set to 0.\n\n \\retval #VPX_CODEC_OK\n     The configuration was populated.\n \\retval #VPX_CODEC_INCAPABLE\n     Interface is not an encoder interface.\n \\retval #VPX_CODEC_INVALID_PARAM\n     A parameter was NULL, or the usage value was not recognized."]
    pub fn vpx_codec_enc_config_default(
        iface: *const vpx_codec_iface,
        cfg: *mut vpx_codec_enc_cfg_t,
        usage: ::std::os::raw::c_uint,
    ) -> vpx_codec_err_t;
}
extern "C" {
    #[doc = "\\brief Set or change configuration\n\n Reconfigures an encoder instance according to the given configuration.\n\n \\param[in]    ctx     Pointer to this instance's context\n \\param[in]    cfg     Configuration buffer to use\n\n \\retval #VPX_CODEC_OK\n     The configuration was populated.\n \\retval #VPX_CODEC_INCAPABLE\n     Interface is not an encoder interface.\n \\retval #VPX_CODEC_INVALID_PARAM\n     A parameter was NULL, or the usage value was not recognized."]
    pub fn vpx_codec_enc_config_set(
        ctx: *mut vpx_codec_ctx_t,
        cfg: *const vpx_codec_enc_cfg_t,
    ) -> vpx_codec_err_t;
}
extern "C" {
    #[doc = "\\brief Get global stream headers\n\n Retrieves a stream level global header packet, if supported by the codec.\n\n \\li VP8: Unsupported\n \\li VP9: Returns a buffer of <tt>ID (1 byte)|Length (1 byte)|Length\n bytes</tt> values. The function should be called after encoding to retrieve\n the most accurate information.\n\n \\param[in]    ctx     Pointer to this instance's context\n\n \\retval NULL\n     Encoder does not support global header\n \\retval Non-NULL\n     Pointer to buffer containing global header packet. The buffer pointer\n     and its contents are only valid for the lifetime of \\a ctx. The contents\n     may change in subsequent calls to the function.\n \\sa\n https://www.webmproject.org/docs/container/#vp9-codec-feature-metadata-codecprivate"]
    pub fn vpx_codec_get_global_headers(ctx: *mut vpx_codec_ctx_t) -> *mut vpx_fixed_buf_t;
}
#[doc = "\\brief Encode Deadline\n\n This type indicates a deadline, in microseconds, to be passed to\n vpx_codec_encode()."]
pub type vpx_enc_deadline_t = ::std::os::raw::c_ulong;
extern "C" {
    #[doc = "\\brief Encode a frame\n\n Encodes a video frame at the given \"presentation time.\" The presentation\n time stamp (PTS) \\ref MUST be strictly increasing.\n\n The encoder supports the notion of a soft real-time deadline. Given a\n non-zero value to the deadline parameter, the encoder will make a \"best\n effort\" guarantee to  return before the given time slice expires. It is\n implicit that limiting the available time to encode will degrade the\n output quality. The encoder can be given an unlimited time to produce the\n best possible frame by specifying a deadline of '0'. This deadline\n supersedes the VPx notion of \"best quality, good quality, realtime\".\n Applications that wish to map these former settings to the new deadline\n based system can use the symbols #VPX_DL_REALTIME, #VPX_DL_GOOD_QUALITY,\n and #VPX_DL_BEST_QUALITY.\n\n When the last frame has been passed to the encoder, this function should\n continue to be called, with the img parameter set to NULL. This will\n signal the end-of-stream condition to the encoder and allow it to encode\n any held buffers. Encoding is complete when vpx_codec_encode() is called\n and vpx_codec_get_cx_data() returns no data.\n\n \\param[in]    ctx       Pointer to this instance's context\n \\param[in]    img       Image data to encode, NULL to flush.\n                         Encoding sample values outside the range\n                         [0..(1<<img->bit_depth)-1] is undefined behavior.\n \\param[in]    pts       Presentation time stamp, in timebase units.\n \\param[in]    duration  Duration to show frame, in timebase units.\n \\param[in]    flags     Flags to use for encoding this frame.\n \\param[in]    deadline  Time to spend encoding, in microseconds. (0=infinite)\n\n \\retval #VPX_CODEC_OK\n     The configuration was populated.\n \\retval #VPX_CODEC_INCAPABLE\n     Interface is not an encoder interface.\n \\retval #VPX_CODEC_INVALID_PARAM\n     A parameter was NULL, the image format is unsupported, etc."]
    pub fn vpx_codec_encode(
        ctx: *mut vpx_codec_ctx_t,
        img: *const vpx_image_t,
        pts: vpx_codec_pts_t,
        duration: ::std::os::raw::c_ulong,
        flags: vpx_enc_frame_flags_t,
        deadline: vpx_enc_deadline_t,
    ) -> vpx_codec_err_t;
}
extern "C" {
    #[doc = "\\brief Set compressed data output buffer\n\n Sets the buffer that the codec should output the compressed data\n into. This call effectively sets the buffer pointer returned in the\n next VPX_CODEC_CX_FRAME_PKT packet. Subsequent packets will be\n appended into this buffer. The buffer is preserved across frames,\n so applications must periodically call this function after flushing\n the accumulated compressed data to disk or to the network to reset\n the pointer to the buffer's head.\n\n `pad_before` bytes will be skipped before writing the compressed\n data, and `pad_after` bytes will be appended to the packet. The size\n of the packet will be the sum of the size of the actual compressed\n data, pad_before, and pad_after. The padding bytes will be preserved\n (not overwritten).\n\n Note that calling this function does not guarantee that the returned\n compressed data will be placed into the specified buffer. In the\n event that the encoded data will not fit into the buffer provided,\n the returned packet \\ref MAY point to an internal buffer, as it would\n if this call were never used. In this event, the output packet will\n NOT have any padding, and the application must free space and copy it\n to the proper place. This is of particular note in configurations\n that may output multiple packets for a single encoded frame (e.g., lagged\n encoding) or if the application does not reset the buffer periodically.\n\n Applications may restore the default behavior of the codec providing\n the compressed data buffer by calling this function with a NULL\n buffer.\n\n Applications \\ref MUSTNOT call this function during iteration of\n vpx_codec_get_cx_data().\n\n \\param[in]    ctx         Pointer to this instance's context\n \\param[in]    buf         Buffer to store compressed data into\n \\param[in]    pad_before  Bytes to skip before writing compressed data\n \\param[in]    pad_after   Bytes to skip after writing compressed data\n\n \\retval #VPX_CODEC_OK\n     The buffer was set successfully.\n \\retval #VPX_CODEC_INVALID_PARAM\n     A parameter was NULL, the image format is unsupported, etc.\n\n \\note\n `duration` and `deadline` are of the unsigned long type, which can be 32\n or 64 bits. `duration` and `deadline` must be less than or equal to\n UINT32_MAX so that their ranges are independent of the size of unsigned\n long."]
    pub fn vpx_codec_set_cx_data_buf(
        ctx: *mut vpx_codec_ctx_t,
        buf: *const vpx_fixed_buf_t,
        pad_before: ::std::os::raw::c_uint,
        pad_after: ::std::os::raw::c_uint,
    ) -> vpx_codec_err_t;
}
extern "C" {
    #[doc = "\\brief Encoded data iterator\n\n Iterates over a list of data packets to be passed from the encoder to the\n application. The different kinds of packets available are enumerated in\n #vpx_codec_cx_pkt_kind.\n\n #VPX_CODEC_CX_FRAME_PKT packets should be passed to the application's\n muxer. Multiple compressed frames may be in the list.\n #VPX_CODEC_STATS_PKT packets should be appended to a global buffer.\n\n The application \\ref MUST silently ignore any packet kinds that it does\n not recognize or support.\n\n The data buffers returned from this function are only guaranteed to be\n valid until the application makes another call to any vpx_codec_* function.\n\n \\param[in]     ctx      Pointer to this instance's context\n \\param[in,out] iter     Iterator storage, initialized to NULL\n\n \\return Returns a pointer to an output data packet (compressed frame data,\n         two-pass statistics, etc.) or NULL to signal end-of-list.\n"]
    pub fn vpx_codec_get_cx_data(
        ctx: *mut vpx_codec_ctx_t,
        iter: *mut vpx_codec_iter_t,
    ) -> *const vpx_codec_cx_pkt_t;
}
extern "C" {
    #[doc = "\\brief Get Preview Frame\n\n Returns an image that can be used as a preview. Shows the image as it would\n exist at the decompressor. The application \\ref MUST NOT write into this\n image buffer.\n\n \\param[in]     ctx      Pointer to this instance's context\n\n \\return Returns a pointer to a preview image, or NULL if no image is\n         available.\n"]
    pub fn vpx_codec_get_preview_frame(ctx: *mut vpx_codec_ctx_t) -> *const vpx_image_t;
}
#[doc = "\\brief External frame buffer\n\n This structure holds allocated frame buffers used by the decoder."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_codec_frame_buffer {
    #[doc = "< Pointer to the data buffer"]
    pub data: *mut u8,
    #[doc = "< Size of data in bytes"]
    pub size: usize,
    #[doc = "< Frame's private data"]
    pub priv_: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_vpx_codec_frame_buffer() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_codec_frame_buffer> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_codec_frame_buffer>(),
        24usize,
        concat!("Size of: ", stringify!(vpx_codec_frame_buffer))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_codec_frame_buffer>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_codec_frame_buffer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_frame_buffer),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_frame_buffer),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priv_) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_frame_buffer),
            "::",
            stringify!(priv_)
        )
    );
}
#[doc = "\\brief External frame buffer\n\n This structure holds allocated frame buffers used by the decoder."]
pub type vpx_codec_frame_buffer_t = vpx_codec_frame_buffer;
#[doc = "\\brief get frame buffer callback prototype\n\n This callback is invoked by the decoder to retrieve data for the frame\n buffer in order for the decode call to complete. The callback must\n allocate at least min_size in bytes and assign it to fb->data. The callback\n must zero out all the data allocated. Then the callback must set fb->size\n to the allocated size. The application does not need to align the allocated\n data. The callback is triggered when the decoder needs a frame buffer to\n decode a compressed image into. This function may be called more than once\n for every call to vpx_codec_decode. The application may set fb->priv to\n some data which will be passed back in the vpx_image_t and the release\n function call. |fb| is guaranteed to not be NULL. On success the callback\n must return 0. Any failure the callback must return a value less than 0.\n\n \\param[in] priv         Callback's private data\n \\param[in] min_size     Size in bytes needed by the buffer\n \\param[in,out] fb       Pointer to vpx_codec_frame_buffer_t"]
pub type vpx_get_frame_buffer_cb_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        priv_: *mut ::std::os::raw::c_void,
        min_size: usize,
        fb: *mut vpx_codec_frame_buffer_t,
    ) -> ::std::os::raw::c_int,
>;
#[doc = "\\brief release frame buffer callback prototype\n\n This callback is invoked by the decoder when the frame buffer is not\n referenced by any other buffers. |fb| is guaranteed to not be NULL. On\n success the callback must return 0. Any failure the callback must return\n a value less than 0.\n\n \\param[in] priv         Callback's private data\n \\param[in] fb           Pointer to vpx_codec_frame_buffer_t"]
pub type vpx_release_frame_buffer_cb_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        priv_: *mut ::std::os::raw::c_void,
        fb: *mut vpx_codec_frame_buffer_t,
    ) -> ::std::os::raw::c_int,
>;
#[doc = "\\brief Stream properties\n\n This structure is used to query or set properties of the decoded\n stream. Algorithms may extend this structure with data specific\n to their bitstream by setting the sz member appropriately."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_codec_stream_info {
    #[doc = "< Size of this structure"]
    pub sz: ::std::os::raw::c_uint,
    #[doc = "< Width (or 0 for unknown/default)"]
    pub w: ::std::os::raw::c_uint,
    #[doc = "< Height (or 0 for unknown/default)"]
    pub h: ::std::os::raw::c_uint,
    #[doc = "< Current frame is a keyframe"]
    pub is_kf: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_vpx_codec_stream_info() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_codec_stream_info> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_codec_stream_info>(),
        16usize,
        concat!("Size of: ", stringify!(vpx_codec_stream_info))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_codec_stream_info>(),
        4usize,
        concat!("Alignment of ", stringify!(vpx_codec_stream_info))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sz) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_stream_info),
            "::",
            stringify!(sz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_stream_info),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).h) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_stream_info),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_kf) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_codec_stream_info),
            "::",
            stringify!(is_kf)
        )
    );
}
#[doc = "\\brief Stream properties\n\n This structure is used to query or set properties of the decoded\n stream. Algorithms may extend this structure with data specific\n to their bitstream by setting the sz member appropriately."]
pub type vpx_codec_stream_info_t = vpx_codec_stream_info;
#[doc = "\\brief Initialization Configurations\n\n This structure is used to pass init time configuration options to the\n decoder."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_codec_dec_cfg {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_vpx_codec_dec_cfg() {
    assert_eq!(
        ::std::mem::size_of::<vpx_codec_dec_cfg>(),
        12usize,
        concat!("Size of: ", stringify!(vpx_codec_dec_cfg))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_codec_dec_cfg>(),
        4usize,
        concat!("Alignment of ", stringify!(vpx_codec_dec_cfg))
    );
}
#[doc = "\\brief Initialization Configurations\n\n This structure is used to pass init time configuration options to the\n decoder."]
pub type vpx_codec_dec_cfg_t = vpx_codec_dec_cfg;
extern "C" {
    #[doc = "\\brief Initialize a decoder instance\n\n Initializes a decoder context using the given interface. Applications\n should call the vpx_codec_dec_init convenience macro instead of this\n function directly, to ensure that the ABI version number parameter\n is properly initialized.\n\n If the library was configured with --disable-multithread, this call\n is not thread safe and should be guarded with a lock if being used\n in a multithreaded context.\n\n \\param[in]    ctx     Pointer to this instance's context.\n \\param[in]    iface   Pointer to the algorithm interface to use.\n \\param[in]    cfg     Configuration to use, if known. May be NULL.\n \\param[in]    flags   Bitfield of VPX_CODEC_USE_* flags\n \\param[in]    ver     ABI version number. Must be set to\n                       VPX_DECODER_ABI_VERSION\n \\retval #VPX_CODEC_OK\n     The decoder algorithm has been initialized.\n \\retval #VPX_CODEC_MEM_ERROR\n     Memory allocation failed."]
    pub fn vpx_codec_dec_init_ver(
        ctx: *mut vpx_codec_ctx_t,
        iface: *const vpx_codec_iface,
        cfg: *const vpx_codec_dec_cfg_t,
        flags: vpx_codec_flags_t,
        ver: ::std::os::raw::c_int,
    ) -> vpx_codec_err_t;
}
extern "C" {
    #[doc = "\\brief Parse stream info from a buffer\n\n Performs high level parsing of the bitstream. Construction of a decoder\n context is not necessary. Can be used to determine if the bitstream is\n of the proper format, and to extract information from the stream.\n\n \\param[in]      iface   Pointer to the algorithm interface\n \\param[in]      data    Pointer to a block of data to parse\n \\param[in]      data_sz Size of the data buffer\n \\param[in,out]  si      Pointer to stream info to update. The sz member\n                         \\ref MUST be properly initialized, but \\ref MAY be\n                         clobbered by the algorithm. This parameter \\ref MAY\n                         be NULL.\n\n \\retval #VPX_CODEC_OK\n     Bitstream is parsable and stream information updated"]
    pub fn vpx_codec_peek_stream_info(
        iface: *const vpx_codec_iface,
        data: *const u8,
        data_sz: ::std::os::raw::c_uint,
        si: *mut vpx_codec_stream_info_t,
    ) -> vpx_codec_err_t;
}
extern "C" {
    #[doc = "\\brief Return information about the current stream.\n\n Returns information about the stream that has been parsed during decoding.\n\n \\param[in]      ctx     Pointer to this instance's context\n \\param[in,out]  si      Pointer to stream info to update. The sz member\n                         \\ref MUST be properly initialized, but \\ref MAY be\n                         clobbered by the algorithm. This parameter \\ref MAY\n                         be NULL.\n\n \\retval #VPX_CODEC_OK\n     Bitstream is parsable and stream information updated"]
    pub fn vpx_codec_get_stream_info(
        ctx: *mut vpx_codec_ctx_t,
        si: *mut vpx_codec_stream_info_t,
    ) -> vpx_codec_err_t;
}
extern "C" {
    #[doc = "\\brief Decode data\n\n Processes a buffer of coded data. If the processing results in a new\n decoded frame becoming available, put_slice and put_frame callbacks may be\n invoked, as appropriate. Encoded data \\ref MUST be passed in DTS (decode\n time stamp) order. Frames produced will always be in PTS (presentation\n time stamp) order.\n If the decoder is configured with VPX_CODEC_USE_INPUT_FRAGMENTS enabled,\n data and data_sz can contain a fragment of the encoded frame. Fragment\n \\#n must contain at least partition \\#n, but can also contain subsequent\n partitions (\\#n+1 - \\#n+i), and if so, fragments \\#n+1, .., \\#n+i must\n be empty. When no more data is available, this function should be called\n with NULL as data and 0 as data_sz. The memory passed to this function\n must be available until the frame has been decoded.\n\n \\param[in] ctx          Pointer to this instance's context\n \\param[in] data         Pointer to this block of new coded data. If\n                         NULL, the put_frame callback is invoked for\n                         the previously decoded frame.\n \\param[in] data_sz      Size of the coded data, in bytes.\n \\param[in] user_priv    Application specific data to associate with\n                         this frame.\n \\param[in] deadline     Soft deadline the decoder should attempt to meet,\n                         in us. Set to zero for unlimited.\n                         NOTE: The deadline parameter is ignored. Always\n                         pass 0.\n\n \\return Returns #VPX_CODEC_OK if the coded data was processed completely\n         and future pictures can be decoded without error. Otherwise,\n         see the descriptions of the other error codes in ::vpx_codec_err_t\n         for recoverability capabilities."]
    pub fn vpx_codec_decode(
        ctx: *mut vpx_codec_ctx_t,
        data: *const u8,
        data_sz: ::std::os::raw::c_uint,
        user_priv: *mut ::std::os::raw::c_void,
        deadline: ::std::os::raw::c_long,
    ) -> vpx_codec_err_t;
}
extern "C" {
    #[doc = "\\brief Decoded frames iterator\n\n Iterates over a list of the frames available for display. The iterator\n storage should be initialized to NULL to start the iteration. Iteration is\n complete when this function returns NULL.\n\n The list of available frames becomes valid upon completion of the\n vpx_codec_decode call, and remains valid until the next call to\n vpx_codec_decode.\n\n \\param[in]     ctx      Pointer to this instance's context\n \\param[in,out] iter     Iterator storage, initialized to NULL\n\n \\return Returns a pointer to an image, if one is ready for display. Frames\n         produced will always be in PTS (presentation time stamp) order."]
    pub fn vpx_codec_get_frame(
        ctx: *mut vpx_codec_ctx_t,
        iter: *mut vpx_codec_iter_t,
    ) -> *mut vpx_image_t;
}
#[doc = "\\brief put frame callback prototype\n\n This callback is invoked by the decoder to notify the application of\n the availability of decoded image data."]
pub type vpx_codec_put_frame_cb_fn_t = ::std::option::Option<
    unsafe extern "C" fn(user_priv: *mut ::std::os::raw::c_void, img: *const vpx_image_t),
>;
extern "C" {
    #[doc = "\\brief Register for notification of frame completion.\n\n Registers a given function to be called when a decoded frame is\n available.\n\n \\param[in] ctx          Pointer to this instance's context\n \\param[in] cb           Pointer to the callback function\n \\param[in] user_priv    User's private data\n\n \\retval #VPX_CODEC_OK\n     Callback successfully registered.\n \\retval #VPX_CODEC_ERROR\n     Decoder context not initialized.\n \\retval #VPX_CODEC_INCAPABLE\n     Algorithm not capable of posting frame completion."]
    pub fn vpx_codec_register_put_frame_cb(
        ctx: *mut vpx_codec_ctx_t,
        cb: vpx_codec_put_frame_cb_fn_t,
        user_priv: *mut ::std::os::raw::c_void,
    ) -> vpx_codec_err_t;
}
#[doc = "\\brief put slice callback prototype\n\n This callback is invoked by the decoder to notify the application of\n the availability of partially decoded image data."]
pub type vpx_codec_put_slice_cb_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        user_priv: *mut ::std::os::raw::c_void,
        img: *const vpx_image_t,
        valid: *const vpx_image_rect_t,
        update: *const vpx_image_rect_t,
    ),
>;
extern "C" {
    #[doc = "\\brief Register for notification of slice completion.\n\n Registers a given function to be called when a decoded slice is\n available.\n\n \\param[in] ctx          Pointer to this instance's context\n \\param[in] cb           Pointer to the callback function\n \\param[in] user_priv    User's private data\n\n \\retval #VPX_CODEC_OK\n     Callback successfully registered.\n \\retval #VPX_CODEC_ERROR\n     Decoder context not initialized.\n \\retval #VPX_CODEC_INCAPABLE\n     Algorithm not capable of posting slice completion."]
    pub fn vpx_codec_register_put_slice_cb(
        ctx: *mut vpx_codec_ctx_t,
        cb: vpx_codec_put_slice_cb_fn_t,
        user_priv: *mut ::std::os::raw::c_void,
    ) -> vpx_codec_err_t;
}
extern "C" {
    #[doc = "\\brief Pass in external frame buffers for the decoder to use.\n\n Registers functions to be called when libvpx needs a frame buffer\n to decode the current frame and a function to be called when libvpx does\n not internally reference the frame buffer. This set function must\n be called before the first call to decode or libvpx will assume the\n default behavior of allocating frame buffers internally.\n\n \\param[in] ctx          Pointer to this instance's context\n \\param[in] cb_get       Pointer to the get callback function\n \\param[in] cb_release   Pointer to the release callback function\n \\param[in] cb_priv      Callback's private data\n\n \\retval #VPX_CODEC_OK\n     External frame buffers will be used by libvpx.\n \\retval #VPX_CODEC_INVALID_PARAM\n     One or more of the callbacks were NULL.\n \\retval #VPX_CODEC_ERROR\n     Decoder context not initialized.\n \\retval #VPX_CODEC_INCAPABLE\n     Algorithm not capable of using external frame buffers.\n\n \\note\n When decoding VP9, the application may be required to pass in at least\n #VP9_MAXIMUM_REF_BUFFERS + #VPX_MAXIMUM_WORK_BUFFERS external frame\n buffers."]
    pub fn vpx_codec_set_frame_buffer_functions(
        ctx: *mut vpx_codec_ctx_t,
        cb_get: vpx_get_frame_buffer_cb_fn_t,
        cb_release: vpx_release_frame_buffer_cb_fn_t,
        cb_priv: *mut ::std::os::raw::c_void,
    ) -> vpx_codec_err_t;
}
#[doc = "\\brief pass in an external frame into decoder to be used as reference frame"]
pub const vp8_com_control_id_VP8_SET_REFERENCE: vp8_com_control_id = 1;
#[doc = "< get a copy of reference frame from the decoder"]
pub const vp8_com_control_id_VP8_COPY_REFERENCE: vp8_com_control_id = 2;
#[doc = "< set the decoder's post processing settings"]
pub const vp8_com_control_id_VP8_SET_POSTPROC: vp8_com_control_id = 3;
#[doc = "< get a pointer to a reference frame"]
pub const vp8_com_control_id_VP9_GET_REFERENCE: vp8_com_control_id = 128;
pub const vp8_com_control_id_VP8_COMMON_CTRL_ID_MAX: vp8_com_control_id = 129;
pub const vp8_com_control_id_VP8_DECODER_CTRL_ID_START: vp8_com_control_id = 256;
#[doc = "\\brief Control functions\n\n The set of macros define the control functions of VP8 interface"]
pub type vp8_com_control_id = ::std::os::raw::c_int;
pub const vp8_postproc_level_VP8_NOFILTERING: vp8_postproc_level = 0;
pub const vp8_postproc_level_VP8_DEBLOCK: vp8_postproc_level = 1;
pub const vp8_postproc_level_VP8_DEMACROBLOCK: vp8_postproc_level = 2;
pub const vp8_postproc_level_VP8_ADDNOISE: vp8_postproc_level = 4;
pub const vp8_postproc_level_VP8_MFQE: vp8_postproc_level = 8;
#[doc = "\\brief post process flags\n\n The set of macros define VP8 decoder post processing flags"]
pub type vp8_postproc_level = ::std::os::raw::c_int;
#[doc = "\\brief post process flags\n\n This define a structure that describe the post processing settings. For\n the best objective measure (using the PSNR metric) set post_proc_flag\n to VP8_DEBLOCK and deblocking_level to 1."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vp8_postproc_cfg {
    #[doc = "\\brief the types of post processing to be done, should be combination of\n \"vp8_postproc_level\""]
    pub post_proc_flag: ::std::os::raw::c_int,
    #[doc = "< the strength of deblocking, valid range [0, 16]"]
    pub deblocking_level: ::std::os::raw::c_int,
    #[doc = "< the strength of additive noise, valid range [0, 16]"]
    pub noise_level: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_vp8_postproc_cfg() {
    const UNINIT: ::std::mem::MaybeUninit<vp8_postproc_cfg> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vp8_postproc_cfg>(),
        12usize,
        concat!("Size of: ", stringify!(vp8_postproc_cfg))
    );
    assert_eq!(
        ::std::mem::align_of::<vp8_postproc_cfg>(),
        4usize,
        concat!("Alignment of ", stringify!(vp8_postproc_cfg))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).post_proc_flag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vp8_postproc_cfg),
            "::",
            stringify!(post_proc_flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).deblocking_level) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vp8_postproc_cfg),
            "::",
            stringify!(deblocking_level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).noise_level) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vp8_postproc_cfg),
            "::",
            stringify!(noise_level)
        )
    );
}
#[doc = "\\brief post process flags\n\n This define a structure that describe the post processing settings. For\n the best objective measure (using the PSNR metric) set post_proc_flag\n to VP8_DEBLOCK and deblocking_level to 1."]
pub type vp8_postproc_cfg_t = vp8_postproc_cfg;
pub const vpx_ref_frame_type_VP8_LAST_FRAME: vpx_ref_frame_type = 1;
pub const vpx_ref_frame_type_VP8_GOLD_FRAME: vpx_ref_frame_type = 2;
pub const vpx_ref_frame_type_VP8_ALTR_FRAME: vpx_ref_frame_type = 4;
#[doc = "\\brief reference frame type\n\n The set of macros define the type of VP8 reference frames"]
pub type vpx_ref_frame_type = ::std::os::raw::c_int;
#[doc = "\\brief reference frame type\n\n The set of macros define the type of VP8 reference frames"]
pub use self::vpx_ref_frame_type as vpx_ref_frame_type_t;
#[doc = "\\brief reference frame data struct\n\n Define the data struct to access vp8 reference frames."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_ref_frame {
    #[doc = "< which reference frame"]
    pub frame_type: vpx_ref_frame_type_t,
    #[doc = "< reference frame data in image format"]
    pub img: vpx_image_t,
}
#[test]
fn bindgen_test_layout_vpx_ref_frame() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_ref_frame> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_ref_frame>(),
        144usize,
        concat!("Size of: ", stringify!(vpx_ref_frame))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_ref_frame>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_ref_frame))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_ref_frame),
            "::",
            stringify!(frame_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).img) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_ref_frame),
            "::",
            stringify!(img)
        )
    );
}
#[doc = "\\brief reference frame data struct\n\n Define the data struct to access vp8 reference frames."]
pub type vpx_ref_frame_t = vpx_ref_frame;
#[doc = "\\brief VP9 specific reference frame data struct\n\n Define the data struct to access vp9 reference frames."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vp9_ref_frame {
    #[doc = "< frame index to get (input)"]
    pub idx: ::std::os::raw::c_int,
    #[doc = "< img structure to populate (output)"]
    pub img: vpx_image_t,
}
#[test]
fn bindgen_test_layout_vp9_ref_frame() {
    const UNINIT: ::std::mem::MaybeUninit<vp9_ref_frame> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vp9_ref_frame>(),
        144usize,
        concat!("Size of: ", stringify!(vp9_ref_frame))
    );
    assert_eq!(
        ::std::mem::align_of::<vp9_ref_frame>(),
        8usize,
        concat!("Alignment of ", stringify!(vp9_ref_frame))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).idx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vp9_ref_frame),
            "::",
            stringify!(idx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).img) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vp9_ref_frame),
            "::",
            stringify!(img)
        )
    );
}
#[doc = "\\brief VP9 specific reference frame data struct\n\n Define the data struct to access vp9 reference frames."]
pub type vp9_ref_frame_t = vp9_ref_frame;
extern "C" {
    #[doc = "\\brief The interface to the VP8 encoder."]
    pub fn vpx_codec_vp8_cx() -> *const vpx_codec_iface;
}
extern "C" {
    #[doc = "\\brief The interface to the VP9 encoder."]
    pub fn vpx_codec_vp9_cx() -> *const vpx_codec_iface;
}
#[doc = "\\brief Codec control function to pass an ROI map to encoder.\n\n Supported in codecs: VP8"]
pub const vp8e_enc_control_id_VP8E_SET_ROI_MAP: vp8e_enc_control_id = 8;
#[doc = "\\brief Codec control function to pass an Active map to encoder.\n\n Supported in codecs: VP8, VP9"]
pub const vp8e_enc_control_id_VP8E_SET_ACTIVEMAP: vp8e_enc_control_id = 9;
#[doc = "\\brief Codec control function to set encoder scaling mode.\n\n Supported in codecs: VP8, VP9"]
pub const vp8e_enc_control_id_VP8E_SET_SCALEMODE: vp8e_enc_control_id = 11;
#[doc = "\\brief Codec control function to set encoder internal speed settings.\n\n Changes in this value influences, among others, the encoder's selection\n of motion estimation methods. Values greater than 0 will increase encoder\n speed at the expense of quality.\n\n \\note Valid range for VP8: -16..16\n \\note Valid range for VP9: -9..9\n \\note A negative value (-n) is treated as its absolute value (n) in VP9.\n\n Supported in codecs: VP8, VP9"]
pub const vp8e_enc_control_id_VP8E_SET_CPUUSED: vp8e_enc_control_id = 13;
#[doc = "\\brief Codec control function to enable automatic use of arf frames.\n\n \\note Valid range for VP8: 0..1\n \\note Valid range for VP9: 0..6\n\n Supported in codecs: VP8, VP9"]
pub const vp8e_enc_control_id_VP8E_SET_ENABLEAUTOALTREF: vp8e_enc_control_id = 14;
#[doc = "\\brief control function to set noise sensitivity\n\n 0: off, 1: OnYOnly, 2: OnYUV,\n 3: OnYUVAggressive, 4: Adaptive\n\n Supported in codecs: VP8"]
pub const vp8e_enc_control_id_VP8E_SET_NOISE_SENSITIVITY: vp8e_enc_control_id = 15;
#[doc = "\\brief Codec control function to set higher sharpness at the expense\n of a lower PSNR.\n\n \\note Valid range: 0..7\n\n Supported in codecs: VP8, VP9"]
pub const vp8e_enc_control_id_VP8E_SET_SHARPNESS: vp8e_enc_control_id = 16;
#[doc = "\\brief Codec control function to set the threshold for MBs treated static.\n\n Supported in codecs: VP8, VP9"]
pub const vp8e_enc_control_id_VP8E_SET_STATIC_THRESHOLD: vp8e_enc_control_id = 17;
#[doc = "\\brief Codec control function to set the number of token partitions.\n\n Supported in codecs: VP8"]
pub const vp8e_enc_control_id_VP8E_SET_TOKEN_PARTITIONS: vp8e_enc_control_id = 18;
#[doc = "\\brief Codec control function to get last quantizer chosen by the encoder.\n\n Return value uses internal quantizer scale defined by the codec.\n\n Supported in codecs: VP8, VP9"]
pub const vp8e_enc_control_id_VP8E_GET_LAST_QUANTIZER: vp8e_enc_control_id = 19;
#[doc = "\\brief Codec control function to get last quantizer chosen by the encoder.\n\n Return value uses the 0..63 scale as used by the rc_*_quantizer config\n parameters.\n\n Supported in codecs: VP8, VP9"]
pub const vp8e_enc_control_id_VP8E_GET_LAST_QUANTIZER_64: vp8e_enc_control_id = 20;
#[doc = "\\brief Codec control function to set the max no of frames to create arf.\n\n Supported in codecs: VP8, VP9"]
pub const vp8e_enc_control_id_VP8E_SET_ARNR_MAXFRAMES: vp8e_enc_control_id = 21;
#[doc = "\\brief Codec control function to set the filter strength for the arf.\n\n Supported in codecs: VP8, VP9"]
pub const vp8e_enc_control_id_VP8E_SET_ARNR_STRENGTH: vp8e_enc_control_id = 22;
#[doc = "\\deprecated control function to set the filter type to use for the arf."]
pub const vp8e_enc_control_id_VP8E_SET_ARNR_TYPE: vp8e_enc_control_id = 23;
#[doc = "\\brief Codec control function to set visual tuning.\n\n Supported in codecs: VP8, VP9"]
pub const vp8e_enc_control_id_VP8E_SET_TUNING: vp8e_enc_control_id = 24;
#[doc = "\\brief Codec control function to set constrained / constant quality level.\n\n \\attention For this value to be used vpx_codec_enc_cfg_t::rc_end_usage must\n            be set to #VPX_CQ or #VPX_Q\n \\note Valid range: 0..63\n\n Supported in codecs: VP8, VP9"]
pub const vp8e_enc_control_id_VP8E_SET_CQ_LEVEL: vp8e_enc_control_id = 25;
#[doc = "\\brief Codec control function to set Max data rate for Intra frames.\n\n This value controls additional clamping on the maximum size of a\n keyframe. It is expressed as a percentage of the average\n per-frame bitrate, with the special (and default) value 0 meaning\n unlimited, or no additional clamping beyond the codec's built-in\n algorithm.\n\n For example, to allocate no more than 4.5 frames worth of bitrate\n to a keyframe, set this to 450.\n\n Supported in codecs: VP8, VP9"]
pub const vp8e_enc_control_id_VP8E_SET_MAX_INTRA_BITRATE_PCT: vp8e_enc_control_id = 26;
#[doc = "\\brief Codec control function to set reference and update frame flags.\n\n  Supported in codecs: VP8"]
pub const vp8e_enc_control_id_VP8E_SET_FRAME_FLAGS: vp8e_enc_control_id = 27;
#[doc = "\\brief Codec control function to set max data rate for Inter frames.\n\n This value controls additional clamping on the maximum size of an\n inter frame. It is expressed as a percentage of the average\n per-frame bitrate, with the special (and default) value 0 meaning\n unlimited, or no additional clamping beyond the codec's built-in\n algorithm.\n\n For example, to allow no more than 4.5 frames worth of bitrate\n to an inter frame, set this to 450.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_MAX_INTER_BITRATE_PCT: vp8e_enc_control_id = 28;
#[doc = "\\brief Boost percentage for Golden Frame in CBR mode.\n\n This value controls the amount of boost given to Golden Frame in\n CBR mode. It is expressed as a percentage of the average\n per-frame bitrate, with the special (and default) value 0 meaning\n the feature is off, i.e., no golden frame boost in CBR mode and\n average bitrate target is used.\n\n For example, to allow 100% more bits, i.e., 2X, in a golden frame\n than average frame, set this to 100.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_GF_CBR_BOOST_PCT: vp8e_enc_control_id = 29;
#[doc = "\\brief Codec control function to set the temporal layer id.\n\n For temporal scalability: this control allows the application to set the\n layer id for each frame to be encoded. Note that this control must be set\n for every frame prior to encoding. The usage of this control function\n supersedes the internal temporal pattern counter, which is now deprecated.\n\n Supported in codecs: VP8"]
pub const vp8e_enc_control_id_VP8E_SET_TEMPORAL_LAYER_ID: vp8e_enc_control_id = 30;
#[doc = "\\brief Codec control function to set encoder screen content mode.\n\n 0: off, 1: On, 2: On with more aggressive rate control.\n\n Supported in codecs: VP8"]
pub const vp8e_enc_control_id_VP8E_SET_SCREEN_CONTENT_MODE: vp8e_enc_control_id = 31;
#[doc = "\\brief Codec control function to set lossless encoding mode.\n\n VP9 can operate in lossless encoding mode, in which the bitstream\n produced will be able to decode and reconstruct a perfect copy of\n input source. This control function provides a mean to switch encoder\n into lossless coding mode(1) or normal coding mode(0) that may be lossy.\n                          0 = lossy coding mode\n                          1 = lossless coding mode\n\n  By default, encoder operates in normal coding mode (maybe lossy).\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_LOSSLESS: vp8e_enc_control_id = 32;
#[doc = "\\brief Codec control function to set number of tile columns.\n\n In encoding and decoding, VP9 allows an input image frame be partitioned\n into separated vertical tile columns, which can be encoded or decoded\n independently. This enables easy implementation of parallel encoding and\n decoding. This control requests the encoder to use column tiles in\n encoding an input frame, with number of tile columns (in Log2 unit) as\n the parameter:\n             0 = 1 tile column\n             1 = 2 tile columns\n             2 = 4 tile columns\n             .....\n             n = 2**n tile columns\n The requested tile columns will be capped by the encoder based on image\n size limitations (The minimum width of a tile column is 256 pixels, the\n maximum is 4096).\n\n By default, the value is 6, i.e., the maximum number of tiles supported by\n the resolution.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_TILE_COLUMNS: vp8e_enc_control_id = 33;
#[doc = "\\brief Codec control function to set number of tile rows.\n\n In encoding and decoding, VP9 allows an input image frame be partitioned\n into separated horizontal tile rows. Tile rows are encoded or decoded\n sequentially. Even though encoding/decoding of later tile rows depends on\n earlier ones, this allows the encoder to output data packets for tile rows\n prior to completely processing all tile rows in a frame, thereby reducing\n the latency in processing between input and output. The parameter\n for this control describes the number of tile rows, which has a valid\n range [0, 2]:\n            0 = 1 tile row\n            1 = 2 tile rows\n            2 = 4 tile rows\n\n By default, the value is 0, i.e. one single row tile for entire image.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_TILE_ROWS: vp8e_enc_control_id = 34;
#[doc = "\\brief Codec control function to enable frame parallel decoding feature.\n\n VP9 has a bitstream feature to reduce decoding dependency between frames\n by turning off backward update of probability context used in encoding\n and decoding. This allows staged parallel processing of more than one\n video frame in the decoder. This control function provides a means to\n turn this feature on or off for bitstreams produced by encoder.\n\n By default, this feature is on.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_FRAME_PARALLEL_DECODING: vp8e_enc_control_id = 35;
#[doc = "\\brief Codec control function to set adaptive quantization mode.\n\n VP9 has a segment based feature that allows encoder to adaptively change\n quantization parameter for each segment within a frame to improve the\n subjective quality. This control makes encoder operate in one of the\n several AQ_modes supported.\n\n By default, encoder operates with AQ_Mode 0(adaptive quantization off).\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_AQ_MODE: vp8e_enc_control_id = 36;
#[doc = "\\brief Codec control function to enable/disable periodic Q boost.\n\n One VP9 encoder speed feature is to enable quality boost by lowering\n frame level Q periodically. This control function provides a mean to\n turn on/off this feature.\n               0 = off\n               1 = on\n\n By default, the encoder is allowed to use this feature for appropriate\n encoding modes.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_FRAME_PERIODIC_BOOST: vp8e_enc_control_id = 37;
#[doc = "\\brief Codec control function to set noise sensitivity.\n\n  0: off, 1: On(YOnly), 2: For SVC only, on top two spatial layers(YOnly)\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_NOISE_SENSITIVITY: vp8e_enc_control_id = 38;
#[doc = "\\brief Codec control function to turn on/off SVC in encoder.\n \\note Return value is VPX_CODEC_INVALID_PARAM if the encoder does not\n       support SVC in its current encoding mode\n  0: off, 1: on\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_SVC: vp8e_enc_control_id = 39;
#[doc = "\\brief Codec control function to pass an ROI map to encoder.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_ROI_MAP: vp8e_enc_control_id = 40;
#[doc = "\\brief Codec control function to set parameters for SVC.\n \\note Parameters contain min_q, max_q, scaling factor for each of the\n       SVC layers.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_SVC_PARAMETERS: vp8e_enc_control_id = 41;
#[doc = "\\brief Codec control function to set svc layer for spatial and temporal.\n \\note Valid ranges: 0..#vpx_codec_enc_cfg::ss_number_layers for spatial\n                     layer and 0..#vpx_codec_enc_cfg::ts_number_layers for\n                     temporal layer.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_SVC_LAYER_ID: vp8e_enc_control_id = 42;
#[doc = "\\brief Codec control function to set content type.\n \\note Valid parameter range:\n              VP9E_CONTENT_DEFAULT = Regular video content (Default)\n              VP9E_CONTENT_SCREEN  = Screen capture content\n              VP9E_CONTENT_FILM    = Film content: improves grain retention\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_TUNE_CONTENT: vp8e_enc_control_id = 43;
#[doc = "\\brief Codec control function to get svc layer ID.\n \\note The layer ID returned is for the data packet from the registered\n       callback function.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_GET_SVC_LAYER_ID: vp8e_enc_control_id = 44;
#[doc = "\\brief Codec control function to register callback to get per layer packet.\n \\note Parameter for this control function is a structure with a callback\n       function and a pointer to private data used by the callback.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_REGISTER_CX_CALLBACK: vp8e_enc_control_id = 45;
#[doc = "\\brief Codec control function to set color space info.\n \\note Valid ranges: 0..7, default is \"UNKNOWN\".\n                     0 = UNKNOWN,\n                     1 = BT_601\n                     2 = BT_709\n                     3 = SMPTE_170\n                     4 = SMPTE_240\n                     5 = BT_2020\n                     6 = RESERVED\n                     7 = SRGB\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_COLOR_SPACE: vp8e_enc_control_id = 46;
#[doc = "\\brief Codec control function to set minimum interval between GF/ARF frames\n\n By default the value is set as 4.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_MIN_GF_INTERVAL: vp8e_enc_control_id = 48;
#[doc = "\\brief Codec control function to set minimum interval between GF/ARF frames\n\n By default the value is set as 16.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_MAX_GF_INTERVAL: vp8e_enc_control_id = 49;
#[doc = "\\brief Codec control function to get an Active map back from the encoder.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_GET_ACTIVEMAP: vp8e_enc_control_id = 50;
#[doc = "\\brief Codec control function to set color range bit.\n \\note Valid ranges: 0..1, default is 0\n                     0 = Limited range (16..235 or HBD equivalent)\n                     1 = Full range (0..255 or HBD equivalent)\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_COLOR_RANGE: vp8e_enc_control_id = 51;
#[doc = "\\brief Codec control function to set the frame flags and buffer indices\n for spatial layers. The frame flags and buffer indices are set using the\n struct #vpx_svc_ref_frame_config defined below.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_SVC_REF_FRAME_CONFIG: vp8e_enc_control_id = 52;
#[doc = "\\brief Codec control function to set intended rendering image size.\n\n By default, this is identical to the image size in pixels.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_RENDER_SIZE: vp8e_enc_control_id = 53;
#[doc = "\\brief Codec control function to set target level.\n\n 255: off (default); 0: only keep level stats; 10: target for level 1.0;\n 11: target for level 1.1; ... 62: target for level 6.2\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_TARGET_LEVEL: vp8e_enc_control_id = 54;
#[doc = "\\brief Codec control function to set row level multi-threading.\n\n 0 : off, 1 : on\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_ROW_MT: vp8e_enc_control_id = 55;
#[doc = "\\brief Codec control function to get bitstream level.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_GET_LEVEL: vp8e_enc_control_id = 56;
#[doc = "\\brief Codec control function to enable/disable special mode for altref\n        adaptive quantization. You can use it with --aq-mode concurrently.\n\n Enable special adaptive quantization for altref frames based on their\n expected prediction quality for the future frames.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_ALT_REF_AQ: vp8e_enc_control_id = 57;
#[doc = "\\brief Boost percentage for Golden Frame in CBR mode.\n\n This value controls the amount of boost given to Golden Frame in\n CBR mode. It is expressed as a percentage of the average\n per-frame bitrate, with the special (and default) value 0 meaning\n the feature is off, i.e., no golden frame boost in CBR mode and\n average bitrate target is used.\n\n For example, to allow 100% more bits, i.e., 2X, in a golden frame\n than average frame, set this to 100.\n\n Supported in codecs: VP8"]
pub const vp8e_enc_control_id_VP8E_SET_GF_CBR_BOOST_PCT: vp8e_enc_control_id = 58;
#[doc = "\\brief Codec control function to enable the extreme motion vector unit test\n in VP9. Please note that this is only used in motion vector unit test.\n\n 0 : off, 1 : MAX_EXTREME_MV, 2 : MIN_EXTREME_MV\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_ENABLE_MOTION_VECTOR_UNIT_TEST: vp8e_enc_control_id = 59;
#[doc = "\\brief Codec control function to constrain the inter-layer prediction\n (prediction of lower spatial resolution) in VP9 SVC.\n\n 0 : inter-layer prediction on, 1 : off, 2 : off only on non-key frames\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_SVC_INTER_LAYER_PRED: vp8e_enc_control_id = 60;
#[doc = "\\brief Codec control function to set mode and thresholds for frame\n  dropping in SVC. Drop frame thresholds are set per-layer. Mode is set as:\n 0 : layer-dependent dropping, 1 : constrained dropping, current layer drop\n forces drop on all upper layers. Default mode is 0.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_SVC_FRAME_DROP_LAYER: vp8e_enc_control_id = 61;
#[doc = "\\brief Codec control function to get the refresh and reference flags and\n the buffer indices, up to the last encoded spatial layer.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_GET_SVC_REF_FRAME_CONFIG: vp8e_enc_control_id = 62;
#[doc = "\\brief Codec control function to enable/disable use of golden reference as\n a second temporal reference for SVC. Only used when inter-layer prediction\n is disabled on INTER frames.\n\n 0: Off, 1: Enabled (default)\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_SVC_GF_TEMPORAL_REF: vp8e_enc_control_id = 63;
#[doc = "\\brief Codec control function to enable spatial layer sync frame, for any\n spatial layer. Enabling it for layer k means spatial layer k will disable\n all temporal prediction, but keep the inter-layer prediction. It will\n refresh any temporal reference buffer for that layer, and reset the\n temporal layer for the superframe to 0. Setting the layer sync for base\n spatial layer forces a key frame. Default is off (0) for all spatial\n layers. Spatial layer sync flag is reset to 0 after each encoded layer,\n so when control is invoked it is only used for the current superframe.\n\n 0: Off (default), 1: Enabled\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_SVC_SPATIAL_LAYER_SYNC: vp8e_enc_control_id = 64;
#[doc = "\\brief Codec control function to enable temporal dependency model.\n\n Vp9 allows the encoder to run temporal dependency model and use it to\n improve the compression performance. To enable, set this parameter to be\n 1. The default value is set to be 1."]
pub const vp8e_enc_control_id_VP9E_SET_TPL: vp8e_enc_control_id = 65;
#[doc = "\\brief Codec control function to enable post encode frame drop.\n\n This will allow encoder to drop frame after it's encoded.\n\n 0: Off (default), 1: Enabled\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_POSTENCODE_DROP: vp8e_enc_control_id = 66;
#[doc = "\\brief Codec control function to set delta q for uv.\n\n Cap it at +/-15.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_DELTA_Q_UV: vp8e_enc_control_id = 67;
#[doc = "\\brief Codec control function to disable increase Q on overshoot in CBR.\n\n 0: On (default), 1: Disable.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_DISABLE_OVERSHOOT_MAXQ_CBR: vp8e_enc_control_id = 68;
#[doc = "\\brief Codec control function to disable loopfilter.\n\n 0: Loopfilter on all frames, 1: Disable on non reference frames.\n 2: Disable on all frames.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_DISABLE_LOOPFILTER: vp8e_enc_control_id = 69;
#[doc = "\\brief Codec control function to enable external rate control library.\n\n args[0]: path of the rate control library\n\n args[1]: private config of the rate control library\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_EXTERNAL_RATE_CONTROL: vp8e_enc_control_id = 70;
#[doc = "\\brief Codec control to disable internal features in rate control.\n\n This will do 3 things, only for 1 pass:\n  - Turn off low motion computation\n  - Turn off gf update constraint on key frame frequency\n  - Turn off content mode for cyclic refresh\n\n With those, the rate control is expected to work exactly the same as the\n interface provided in ratectrl_rtc.cc/h\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_SET_RTC_EXTERNAL_RATECTRL: vp8e_enc_control_id = 71;
#[doc = "\\brief Codec control function to get loopfilter level in the encoder.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_GET_LOOPFILTER_LEVEL: vp8e_enc_control_id = 72;
#[doc = "\\brief Codec control to get last quantizers for all spatial layers.\n\n Return value uses an array of internal quantizers scale defined by the\n codec, for all spatial layers.\n The size of the array passed in should be #VPX_SS_MAX_LAYERS.\n\n Supported in codecs: VP9"]
pub const vp8e_enc_control_id_VP9E_GET_LAST_QUANTIZER_SVC_LAYERS: vp8e_enc_control_id = 73;
#[doc = "\\brief Codec control to disable internal features in rate control.\n\n This will turn off cyclic refresh for vp8.\n\n With this, the rate control is expected to work exactly the same as the\n interface provided in vp8_ratectrl_rtc.cc/h\n\n Supported in codecs: VP8"]
pub const vp8e_enc_control_id_VP8E_SET_RTC_EXTERNAL_RATECTRL: vp8e_enc_control_id = 74;
#[doc = "\\brief Codec control to set quantizer for the next frame.\n\n This will turn off cyclic refresh. Only applicable to 1-pass without\n spatial layers.\n\n Supported in codecs: VP9\n"]
pub const vp8e_enc_control_id_VP9E_SET_QUANTIZER_ONE_PASS: vp8e_enc_control_id = 75;
#[doc = "\\brief Codec control function to enable key frame temporal filtering.\n\n Vp9 allows the encoder to run key frame temporal filtering and use it to\n improve the compression performance. To enable, set this parameter to be\n 1. The default value is set to be 0."]
pub const vp8e_enc_control_id_VP9E_SET_KEY_FRAME_FILTERING: vp8e_enc_control_id = 76;
#[doc = "\\brief VPx encoder control functions\n\n This set of macros define the control functions available for VPx\n encoder interface.\n\n \\sa #vpx_codec_control"]
pub type vp8e_enc_control_id = ::std::os::raw::c_int;
pub const vpx_scaling_mode_1d_VP8E_NORMAL: vpx_scaling_mode_1d = 0;
pub const vpx_scaling_mode_1d_VP8E_FOURFIVE: vpx_scaling_mode_1d = 1;
pub const vpx_scaling_mode_1d_VP8E_THREEFIVE: vpx_scaling_mode_1d = 2;
pub const vpx_scaling_mode_1d_VP8E_ONETWO: vpx_scaling_mode_1d = 3;
#[doc = "\\brief vpx 1-D scaling mode\n\n This set of constants define 1-D vpx scaling modes"]
pub type vpx_scaling_mode_1d = ::std::os::raw::c_int;
#[doc = "\\brief vpx 1-D scaling mode\n\n This set of constants define 1-D vpx scaling modes"]
pub use self::vpx_scaling_mode_1d as VPX_SCALING_MODE;
#[doc = "\\brief  vpx region of interest map\n\n These defines the data structures for the region of interest map\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_roi_map {
    #[doc = " If ROI is enabled."]
    pub enabled: u8,
    #[doc = " An id between 0-3 (0-7 for vp9) for each 16x16 (8x8 for VP9)\n region within a frame."]
    pub roi_map: *mut ::std::os::raw::c_uchar,
    #[doc = "< Number of rows."]
    pub rows: ::std::os::raw::c_uint,
    #[doc = "< Number of columns."]
    pub cols: ::std::os::raw::c_uint,
    #[doc = "< Quantizer deltas. Valid range: [-63, 63]."]
    pub delta_q: [::std::os::raw::c_int; 8usize],
    #[doc = "< Loop filter deltas. Valid range: [-63, 63]."]
    pub delta_lf: [::std::os::raw::c_int; 8usize],
    #[doc = "< Skip this block."]
    pub skip: [::std::os::raw::c_int; 8usize],
    #[doc = "< Reference frame for this block."]
    pub ref_frame: [::std::os::raw::c_int; 8usize],
    #[doc = " Static breakout threshold for each segment. Only used in VP8."]
    pub static_threshold: [::std::os::raw::c_uint; 4usize],
}
#[test]
fn bindgen_test_layout_vpx_roi_map() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_roi_map> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_roi_map>(),
        168usize,
        concat!("Size of: ", stringify!(vpx_roi_map))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_roi_map>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_roi_map))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enabled) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_roi_map),
            "::",
            stringify!(enabled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).roi_map) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_roi_map),
            "::",
            stringify!(roi_map)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rows) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_roi_map),
            "::",
            stringify!(rows)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cols) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_roi_map),
            "::",
            stringify!(cols)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delta_q) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_roi_map),
            "::",
            stringify!(delta_q)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delta_lf) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_roi_map),
            "::",
            stringify!(delta_lf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skip) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_roi_map),
            "::",
            stringify!(skip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ref_frame) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_roi_map),
            "::",
            stringify!(ref_frame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).static_threshold) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_roi_map),
            "::",
            stringify!(static_threshold)
        )
    );
}
#[doc = "\\brief  vpx region of interest map\n\n These defines the data structures for the region of interest map\n"]
pub type vpx_roi_map_t = vpx_roi_map;
#[doc = "\\brief  vpx active region map\n\n These defines the data structures for active region map\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_active_map {
    #[doc = "\\brief specify an on (1) or off (0) each 16x16 region within a frame"]
    pub active_map: *mut ::std::os::raw::c_uchar,
    #[doc = "< number of rows"]
    pub rows: ::std::os::raw::c_uint,
    #[doc = "< number of cols"]
    pub cols: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_vpx_active_map() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_active_map> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_active_map>(),
        16usize,
        concat!("Size of: ", stringify!(vpx_active_map))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_active_map>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_active_map))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).active_map) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_active_map),
            "::",
            stringify!(active_map)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rows) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_active_map),
            "::",
            stringify!(rows)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cols) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_active_map),
            "::",
            stringify!(cols)
        )
    );
}
#[doc = "\\brief  vpx active region map\n\n These defines the data structures for active region map\n"]
pub type vpx_active_map_t = vpx_active_map;
#[doc = "\\brief  vpx image scaling mode\n\n This defines the data structure for image scaling mode\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_scaling_mode {
    #[doc = "< horizontal scaling mode"]
    pub h_scaling_mode: VPX_SCALING_MODE,
    #[doc = "< vertical scaling mode"]
    pub v_scaling_mode: VPX_SCALING_MODE,
}
#[test]
fn bindgen_test_layout_vpx_scaling_mode() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_scaling_mode> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_scaling_mode>(),
        8usize,
        concat!("Size of: ", stringify!(vpx_scaling_mode))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_scaling_mode>(),
        4usize,
        concat!("Alignment of ", stringify!(vpx_scaling_mode))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).h_scaling_mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_scaling_mode),
            "::",
            stringify!(h_scaling_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v_scaling_mode) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_scaling_mode),
            "::",
            stringify!(v_scaling_mode)
        )
    );
}
#[doc = "\\brief  vpx image scaling mode\n\n This defines the data structure for image scaling mode\n"]
pub type vpx_scaling_mode_t = vpx_scaling_mode;
pub const vp8e_token_partitions_VP8_ONE_TOKENPARTITION: vp8e_token_partitions = 0;
pub const vp8e_token_partitions_VP8_TWO_TOKENPARTITION: vp8e_token_partitions = 1;
pub const vp8e_token_partitions_VP8_FOUR_TOKENPARTITION: vp8e_token_partitions = 2;
pub const vp8e_token_partitions_VP8_EIGHT_TOKENPARTITION: vp8e_token_partitions = 3;
#[doc = "\\brief VP8 token partition mode\n\n This defines VP8 partitioning mode for compressed data, i.e., the number of\n sub-streams in the bitstream. Used for parallelized decoding.\n"]
pub type vp8e_token_partitions = ::std::os::raw::c_int;
pub const vp8e_tuning_VP8_TUNE_PSNR: vp8e_tuning = 0;
pub const vp8e_tuning_VP8_TUNE_SSIM: vp8e_tuning = 1;
#[doc = "\\brief VP8 model tuning parameters\n\n Changes the encoder to tune for certain types of input material.\n"]
pub type vp8e_tuning = ::std::os::raw::c_int;
#[doc = "\\brief  vp9 svc layer parameters\n\n This defines the spatial and temporal layer id numbers for svc encoding.\n This is used with the #VP9E_SET_SVC_LAYER_ID control to set the spatial and\n temporal layer id for the current frame.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_svc_layer_id {
    #[doc = "< First spatial layer to start encoding."]
    pub spatial_layer_id: ::std::os::raw::c_int,
    #[doc = "< Temporal layer id number."]
    pub temporal_layer_id: ::std::os::raw::c_int,
    #[doc = "< Temp layer id."]
    pub temporal_layer_id_per_spatial: [::std::os::raw::c_int; 5usize],
}
#[test]
fn bindgen_test_layout_vpx_svc_layer_id() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_svc_layer_id> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_svc_layer_id>(),
        28usize,
        concat!("Size of: ", stringify!(vpx_svc_layer_id))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_svc_layer_id>(),
        4usize,
        concat!("Alignment of ", stringify!(vpx_svc_layer_id))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spatial_layer_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_layer_id),
            "::",
            stringify!(spatial_layer_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).temporal_layer_id) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_layer_id),
            "::",
            stringify!(temporal_layer_id)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).temporal_layer_id_per_spatial) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_layer_id),
            "::",
            stringify!(temporal_layer_id_per_spatial)
        )
    );
}
#[doc = "\\brief  vp9 svc layer parameters\n\n This defines the spatial and temporal layer id numbers for svc encoding.\n This is used with the #VP9E_SET_SVC_LAYER_ID control to set the spatial and\n temporal layer id for the current frame.\n"]
pub type vpx_svc_layer_id_t = vpx_svc_layer_id;
#[doc = "\\brief vp9 svc frame flag parameters.\n\n This defines the frame flags and buffer indices for each spatial layer for\n svc encoding.\n This is used with the #VP9E_SET_SVC_REF_FRAME_CONFIG control to set frame\n flags and buffer indices for each spatial layer for the current (super)frame.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_svc_ref_frame_config {
    #[doc = "< Last buffer index."]
    pub lst_fb_idx: [::std::os::raw::c_int; 5usize],
    #[doc = "< Golden buffer index."]
    pub gld_fb_idx: [::std::os::raw::c_int; 5usize],
    #[doc = "< Altref buffer index."]
    pub alt_fb_idx: [::std::os::raw::c_int; 5usize],
    #[doc = "< Update reference frames."]
    pub update_buffer_slot: [::std::os::raw::c_int; 5usize],
    #[doc = "< Update last."]
    pub update_last: [::std::os::raw::c_int; 5usize],
    #[doc = "< Update golden."]
    pub update_golden: [::std::os::raw::c_int; 5usize],
    #[doc = "< Update altref."]
    pub update_alt_ref: [::std::os::raw::c_int; 5usize],
    #[doc = "< Last as reference."]
    pub reference_last: [::std::os::raw::c_int; 5usize],
    #[doc = "< Golden as reference."]
    pub reference_golden: [::std::os::raw::c_int; 5usize],
    #[doc = "< Altref as reference."]
    pub reference_alt_ref: [::std::os::raw::c_int; 5usize],
    #[doc = "< Duration per spatial layer."]
    pub duration: [i64; 5usize],
}
#[test]
fn bindgen_test_layout_vpx_svc_ref_frame_config() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_svc_ref_frame_config> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_svc_ref_frame_config>(),
        240usize,
        concat!("Size of: ", stringify!(vpx_svc_ref_frame_config))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_svc_ref_frame_config>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_svc_ref_frame_config))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lst_fb_idx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_ref_frame_config),
            "::",
            stringify!(lst_fb_idx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gld_fb_idx) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_ref_frame_config),
            "::",
            stringify!(gld_fb_idx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alt_fb_idx) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_ref_frame_config),
            "::",
            stringify!(alt_fb_idx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).update_buffer_slot) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_ref_frame_config),
            "::",
            stringify!(update_buffer_slot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).update_last) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_ref_frame_config),
            "::",
            stringify!(update_last)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).update_golden) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_ref_frame_config),
            "::",
            stringify!(update_golden)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).update_alt_ref) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_ref_frame_config),
            "::",
            stringify!(update_alt_ref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reference_last) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_ref_frame_config),
            "::",
            stringify!(reference_last)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reference_golden) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_ref_frame_config),
            "::",
            stringify!(reference_golden)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reference_alt_ref) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_ref_frame_config),
            "::",
            stringify!(reference_alt_ref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).duration) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_ref_frame_config),
            "::",
            stringify!(duration)
        )
    );
}
#[doc = "\\brief vp9 svc frame flag parameters.\n\n This defines the frame flags and buffer indices for each spatial layer for\n svc encoding.\n This is used with the #VP9E_SET_SVC_REF_FRAME_CONFIG control to set frame\n flags and buffer indices for each spatial layer for the current (super)frame.\n"]
pub type vpx_svc_ref_frame_config_t = vpx_svc_ref_frame_config;
pub const SVC_LAYER_DROP_MODE_CONSTRAINED_LAYER_DROP: SVC_LAYER_DROP_MODE = 0;
#[doc = "< Any spatial layer can drop."]
pub const SVC_LAYER_DROP_MODE_LAYER_DROP: SVC_LAYER_DROP_MODE = 1;
#[doc = "< Only full superframe can drop."]
pub const SVC_LAYER_DROP_MODE_FULL_SUPERFRAME_DROP: SVC_LAYER_DROP_MODE = 2;
pub const SVC_LAYER_DROP_MODE_CONSTRAINED_FROM_ABOVE_DROP: SVC_LAYER_DROP_MODE = 3;
#[doc = "\\brief VP9 svc frame dropping mode.\n\n This defines the frame drop mode for SVC.\n"]
pub type SVC_LAYER_DROP_MODE = ::std::os::raw::c_int;
#[doc = "\\brief vp9 svc frame dropping parameters.\n\n This defines the frame drop thresholds for each spatial layer, and\n the frame dropping mode: 0 = layer based frame dropping (default),\n 1 = constrained dropping where current layer drop forces all upper\n spatial layers to drop."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_svc_frame_drop {
    #[doc = "< Frame drop thresholds"]
    pub framedrop_thresh: [::std::os::raw::c_int; 5usize],
    #[doc = "< Layer-based or constrained dropping."]
    pub framedrop_mode: SVC_LAYER_DROP_MODE,
    #[doc = "< Maximum consecutive drops, for any layer."]
    pub max_consec_drop: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_vpx_svc_frame_drop() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_svc_frame_drop> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_svc_frame_drop>(),
        28usize,
        concat!("Size of: ", stringify!(vpx_svc_frame_drop))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_svc_frame_drop>(),
        4usize,
        concat!("Alignment of ", stringify!(vpx_svc_frame_drop))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).framedrop_thresh) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_frame_drop),
            "::",
            stringify!(framedrop_thresh)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).framedrop_mode) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_frame_drop),
            "::",
            stringify!(framedrop_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_consec_drop) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_frame_drop),
            "::",
            stringify!(max_consec_drop)
        )
    );
}
#[doc = "\\brief vp9 svc frame dropping parameters.\n\n This defines the frame drop thresholds for each spatial layer, and\n the frame dropping mode: 0 = layer based frame dropping (default),\n 1 = constrained dropping where current layer drop forces all upper\n spatial layers to drop."]
pub type vpx_svc_frame_drop_t = vpx_svc_frame_drop;
#[doc = "\\brief vp9 svc spatial layer sync parameters.\n\n This defines the spatial layer sync flag, defined per spatial layer.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_svc_spatial_layer_sync {
    #[doc = "< Sync layer flags"]
    pub spatial_layer_sync: [::std::os::raw::c_int; 5usize],
    #[doc = "< Flag for setting Intra-only frame on base"]
    pub base_layer_intra_only: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_vpx_svc_spatial_layer_sync() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_svc_spatial_layer_sync> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_svc_spatial_layer_sync>(),
        24usize,
        concat!("Size of: ", stringify!(vpx_svc_spatial_layer_sync))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_svc_spatial_layer_sync>(),
        4usize,
        concat!("Alignment of ", stringify!(vpx_svc_spatial_layer_sync))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spatial_layer_sync) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_spatial_layer_sync),
            "::",
            stringify!(spatial_layer_sync)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base_layer_intra_only) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_svc_spatial_layer_sync),
            "::",
            stringify!(base_layer_intra_only)
        )
    );
}
#[doc = "\\brief vp9 svc spatial layer sync parameters.\n\n This defines the spatial layer sync flag, defined per spatial layer.\n"]
pub type vpx_svc_spatial_layer_sync_t = vpx_svc_spatial_layer_sync;
extern "C" {
    #[doc = "\\brief The interface to the VP8 decoder."]
    pub fn vpx_codec_vp8_dx() -> *const vpx_codec_iface;
}
extern "C" {
    #[doc = "\\brief The interface to the VP9 decoder."]
    pub fn vpx_codec_vp9_dx() -> *const vpx_codec_iface;
}
#[doc = " control function to get info on which reference frames were updated\n  by the last decode"]
pub const vp8_dec_control_id_VP8D_GET_LAST_REF_UPDATES: vp8_dec_control_id = 256;
#[doc = " check if the indicated frame is corrupted"]
pub const vp8_dec_control_id_VP8D_GET_FRAME_CORRUPTED: vp8_dec_control_id = 257;
#[doc = " control function to get info on which reference frames were used\n  by the last decode"]
pub const vp8_dec_control_id_VP8D_GET_LAST_REF_USED: vp8_dec_control_id = 258;
#[doc = " decryption function to decrypt encoded buffer data immediately\n before decoding. Takes a vpx_decrypt_init, which contains\n a callback function and opaque context pointer."]
pub const vp8_dec_control_id_VPXD_SET_DECRYPTOR: vp8_dec_control_id = 259;
#[doc = " decryption function to decrypt encoded buffer data immediately\n before decoding. Takes a vpx_decrypt_init, which contains\n a callback function and opaque context pointer."]
pub const vp8_dec_control_id_VP8D_SET_DECRYPTOR: vp8_dec_control_id = 259;
#[doc = " control function to get the dimensions that the current frame is decoded\n at. This may be different to the intended display size for the frame as\n specified in the wrapper or frame header (see VP9D_GET_DISPLAY_SIZE)."]
pub const vp8_dec_control_id_VP9D_GET_FRAME_SIZE: vp8_dec_control_id = 260;
#[doc = " control function to get the current frame's intended display dimensions\n (as specified in the wrapper or frame header). This may be different to\n the decoded dimensions of this frame (see VP9D_GET_FRAME_SIZE)."]
pub const vp8_dec_control_id_VP9D_GET_DISPLAY_SIZE: vp8_dec_control_id = 261;
#[doc = " control function to get the bit depth of the stream."]
pub const vp8_dec_control_id_VP9D_GET_BIT_DEPTH: vp8_dec_control_id = 262;
#[doc = " control function to set the byte alignment of the planes in the reference\n buffers. Valid values are power of 2, from 32 to 1024. A value of 0 sets\n legacy alignment. I.e. Y plane is aligned to 32 bytes, U plane directly\n follows Y plane, and V plane directly follows U plane. Default value is 0."]
pub const vp8_dec_control_id_VP9_SET_BYTE_ALIGNMENT: vp8_dec_control_id = 263;
#[doc = " control function to invert the decoding order to from right to left. The\n function is used in a test to confirm the decoding independence of tile\n columns. The function may be used in application where this order\n of decoding is desired.\n\n TODO(yaowu): Rework the unit test that uses this control, and in a future\n              release, this test-only control shall be removed."]
pub const vp8_dec_control_id_VP9_INVERT_TILE_DECODE_ORDER: vp8_dec_control_id = 264;
#[doc = " control function to set the skip loop filter flag. Valid values are\n integers. The decoder will skip the loop filter when its value is set to\n nonzero. If the loop filter is skipped the decoder may accumulate decode\n artifacts. The default value is 0."]
pub const vp8_dec_control_id_VP9_SET_SKIP_LOOP_FILTER: vp8_dec_control_id = 265;
#[doc = " control function to decode SVC stream up to the x spatial layers,\n where x is passed in through the control, and is 0 for base layer."]
pub const vp8_dec_control_id_VP9_DECODE_SVC_SPATIAL_LAYER: vp8_dec_control_id = 266;
#[doc = "\\brief Codec control function to get last decoded frame quantizer.\n\n Return value uses internal quantizer scale defined by the codec.\n\n Supported in codecs: VP8, VP9"]
pub const vp8_dec_control_id_VPXD_GET_LAST_QUANTIZER: vp8_dec_control_id = 267;
#[doc = "\\brief Codec control function to set row level multi-threading.\n\n 0 : off, 1 : on\n\n Supported in codecs: VP9"]
pub const vp8_dec_control_id_VP9D_SET_ROW_MT: vp8_dec_control_id = 268;
#[doc = "\\brief Codec control function to set loopfilter optimization.\n\n 0 : off, Loop filter is done after all tiles have been decoded\n 1 : on, Loop filter is done immediately after decode without\n     waiting for all threads to sync.\n\n Supported in codecs: VP9"]
pub const vp8_dec_control_id_VP9D_SET_LOOP_FILTER_OPT: vp8_dec_control_id = 269;
#[doc = "\\brief Codec control function to set loopfilter optimization.\n\n 0 : off, Loop filter is done after all tiles have been decoded\n 1 : on, Loop filter is done immediately after decode without\n     waiting for all threads to sync.\n\n Supported in codecs: VP9"]
pub const vp8_dec_control_id_VP8_DECODER_CTRL_ID_MAX: vp8_dec_control_id = 270;
#[doc = "\\enum vp8_dec_control_id\n \\brief VP8 decoder control functions\n\n This set of macros define the control functions available for the VP8\n decoder interface.\n\n \\sa #vpx_codec_control"]
pub type vp8_dec_control_id = ::std::os::raw::c_int;
#[doc = " Decrypt n bytes of data from input -> output, using the decrypt_state\n  passed in VPXD_SET_DECRYPTOR."]
pub type vpx_decrypt_cb = ::std::option::Option<
    unsafe extern "C" fn(
        decrypt_state: *mut ::std::os::raw::c_void,
        input: *const ::std::os::raw::c_uchar,
        output: *mut ::std::os::raw::c_uchar,
        count: ::std::os::raw::c_int,
    ),
>;
#[doc = "\\brief Structure to hold decryption state\n\n Defines a structure to hold the decryption state and access function."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vpx_decrypt_init {
    #[doc = " Decrypt callback."]
    pub decrypt_cb: vpx_decrypt_cb,
    #[doc = " Decryption state."]
    pub decrypt_state: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_vpx_decrypt_init() {
    const UNINIT: ::std::mem::MaybeUninit<vpx_decrypt_init> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<vpx_decrypt_init>(),
        16usize,
        concat!("Size of: ", stringify!(vpx_decrypt_init))
    );
    assert_eq!(
        ::std::mem::align_of::<vpx_decrypt_init>(),
        8usize,
        concat!("Alignment of ", stringify!(vpx_decrypt_init))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decrypt_cb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_decrypt_init),
            "::",
            stringify!(decrypt_cb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decrypt_state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vpx_decrypt_init),
            "::",
            stringify!(decrypt_state)
        )
    );
}
